/* eslint-disable */
const la = [{
    'id': 'ChIJ4YUGoTXHwoARDMbvw9fXQ6I', 'name': 'Moa Bar', 'address': '865 South Vermont Avenue, Los Angeles', 'types': ['restaurant', 'bar', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0562517, 'lng': -118.291827 }, 'rating': 4.5, 'rating_n': 58, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14,
            25, 35, 42, 42, 36, 27]
    }, { 'name': 'Tuesday', 'data': [15, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 26, 22, 15, 17, 18, 14] }, {
        'name':
            'Wednesday', 'data': [6, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 27, 22, 10, 18, 42, 40]
    }, {
        'name': 'Thursday', 'data': [14, 1, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18, 26, 31, 39, 51, 47, 23]
    }, { 'name': 'Friday', 'data': [1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23, 50, 59, 60, 73, 85, 75] }, { 'name': 'Saturday', 'data': [46, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 39, 53, 59, 73, 97, 100] },
    { 'name': 'Sunday', 'data': [73, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_wait': [{
        'name': 'Monday', 'data':
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name':
            'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0,
            15, 15, 15]
    }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [25, 120]
}, {
    'id': 'ChIJHRtGw2THwoAReX6EOcNEn_U', 'name': 'Shatto 39 Lanes', 'address': '3255 4th Street, Los Angeles', 'types': ['bowling_alley', 'bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.06738, 'lng': -118.2912775 }, 'rating': 4.4, 'rating_n': 1737, 'populartimes': [{
        'name':
            'Monday', 'data': [31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 25, 36, 42, 43, 42, 38]
    }, { 'name': 'Tuesday', 'data': [30, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 17, 28, 35, 39, 40, 39] }, { 'name': 'Wednesday', 'data': [31, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 28, 39, 45, 44, 40, 35] }, { 'name': 'Thursday', 'data': [27, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 25, 37, 42, 41, 40, 38] }, { 'name': 'Friday', 'data': [30, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 6, 6, 8, 10, 16, 28, 45, 62, 70, 64] }, {
        'name': 'Saturday', 'data': [47,
            28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 14, 20, 29, 39, 48, 59, 76, 95, 100, 79]
    }, {
        'name': 'Sunday', 'data': [46, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 14, 22, 30, 38, 43, 45, 45, 46, 49, 49, 43]
    }], 'time_spent': [60, 150]
}, {
    'id': 'ChIJMy8DfnnHwoARaGsVvBrF28c', 'name': 'Buffalo Wild Wings', 'address': '3150 Wilshire Boulevard Suite 100, Los Angeles', 'types': ['meal_takeaway', 'bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0613026, 'lng': -118.2910184 }, 'rating': 3.9, 'rating_n': 1790, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 11, 18, 25, 34, 44, 56, 68, 75, 73, 61, 44, 27] }, {
        'name': 'Tuesday', 'data': [16, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 13, 37, 45, 31, 22, 30, 46, 61, 70, 70, 60, 45, 28]
    }, { 'name': 'Wednesday', 'data': [14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 12, 19, 25, 29, 35, 44, 56, 66, 69, 60, 44, 27] }, { 'name': 'Thursday', 'data': [14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 19, 27, 28, 25, 30, 47, 71, 90, 95, 83, 59, 34] },
    { 'name': 'Friday', 'data': [14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 15, 24, 33, 45, 58, 73, 87, 97, 100, 93, 79, 60] }, { 'name': 'Saturday', 'data': [41, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 17, 26, 37, 48, 59, 69, 76, 82, 87, 88, 83, 72] }, { 'name': 'Sunday', 'data': [55, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 32, 50, 65, 77, 84, 89, 94, 98, 98, 91, 77, 59, 40] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 15, 30, 30, 30, 30, 30, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 30, 15, 15, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, 30, 30, 30, 30, 15, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 30, 30, 45, 45, 45, 45, 30] }, {
        'name': 'Saturday', 'data': [15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 15, 15, 15, 15, 30, 30,
            45, 45, 45, 30]
    }, { 'name': 'Sunday', 'data': [15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 30, 30, 30, 30, 30, 15, 0] }]
}, {
    'id': 'ChIJj6arSYLHwoAROfRRqiOfX2s', 'name': "Park's BBQ", 'address': '955 South Vermont Avenue G, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0539567, 'lng': -118.292058 }, 'rating': 4.4, 'rating_n': 1634, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 36, 45, 45, 37, 29, 31, 48, 66, 66, 47, 22, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 35, 45, 46, 38, 28, 28, 48, 77, 87, 66, 33, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 32, 49, 50, 37, 27, 35, 58, 80, 83, 64, 36, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 35, 45, 46, 38, 31, 36, 58, 85, 94, 75, 42, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 36, 47, 48, 40, 31, 35, 57, 85, 95, 77, 45, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 37, 55, 60, 51, 43, 53, 78, 100, 98, 72, 39, 0, 0] }, {
        'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 40, 54, 60, 57, 56, 65, 85, 98, 90, 62, 32, 0, 0]
    }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 30, 30, 30, 15, 30, 30, 15, 15, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 30, 15, 15, 15, 15, 30, 30, 15, 15, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 30, 30, 30, 30, 30, 15, 15, 15, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 30, 30, 15, 30, 30, 15, 15, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 30, 15, 15, 30, 45, 45, 15, 15, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 30, 30, 30, 30, 45, 45, 15, 15, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 30, 30, 30, 15, 45, 60, 60, 30, 15, 0, 0] }], 'time_spent': [45, 90]
}, {
    'id': 'ChIJP4sQZ2THwoAR0S0tAb3aQek', 'name': 'Monte Carlo Bar', 'address': '3514 West 3rd Street, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0688678, 'lng': -118.2922396 }, 'rating': 4.3, 'rating_n': 66, 'populartimes': [{ 'name': 'Monday', 'data': [39, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 14, 25, 30, 28, 28]
    }, { 'name': 'Thursday', 'data': [29, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 40, 49, 47, 45] }, { 'name': 'Friday', 'data': [48, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 32, 46, 49, 45, 43] }, {
        'name': 'Saturday', 'data': [46, 42,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 60, 100, 89, 53, 47]
    }, {
        'name': 'Sunday', 'data': [58, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 55, 53, 33, 24, 37, 51]
    }]
}, {
    'id': 'ChIJW-yJPuPHwoAR8VoJQABn7KE', 'name': 'Moreton Fig', 'address': '3607 Trousdale Parkway, Los Angeles', 'types': ['bar', 'restaurant', 'point_of_interest', 'food', 'establishment'], 'coordinates': { 'lat': 34.0198198, 'lng': -118.2859618 }, 'rating': 3.6, 'rating_n': 30, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 40, 60, 70, 70, 60, 70, 80, 60, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 50, 60, 60, 80, 100, 100, 70, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40,
            70, 90, 90, 80, 70, 90, 90, 60, 0, 0, 0, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Sunday', 'data': [0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }]
}, {
    'id': 'ChIJvY3Wk3DHwoARvLmCnfUnMkA', 'name': 'Shrine', 'address': '2999 West 6th Street, Los Angeles', 'types': ['night_club', 'bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.063992, 'lng': -118.2866606 }, 'rating': 4.2, 'rating_n': 223, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 18, 17, 17, 18] }, { 'name': 'Tuesday', 'data': [16, 11, 6, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 18, 22, 23, 21] }, { 'name': 'Wednesday', 'data': [17, 12, 7, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 21, 24, 22, 25, 22] }, {
        'name': 'Thursday', 'data': [14, 7, 3, 1, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 24, 32, 38, 40]
    }, { 'name': 'Friday', 'data': [36, 29, 21, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 45, 61, 71, 76] }, { 'name': 'Saturday', 'data': [75, 63, 43, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 35, 67, 87, 86, 86] }, { 'name': 'Sunday', 'data': [97, 100, 78, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [90, 180]
}, {
    'id': 'ChIJWzEOsXnHwoAR1jPh99m4lsU', 'name': 'Moodaepo II', 'address': '3014 7th Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0595455, 'lng': -118.2897069 }, 'rating': 4.1, 'rating_n': 962, 'current_popularity': 47, 'populartimes': [{ 'name': 'Monday', 'data': [17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 6, 9, 12, 15, 18, 24, 34, 44, 46, 39, 25] }, { 'name': 'Tuesday', 'data': [11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 4, 4, 4, 6, 14, 27, 41, 50, 50, 40, 26] }, {
        'name': 'Wednesday', 'data': [13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 10,
            15, 15, 13, 16, 25, 40, 51, 53, 43, 27]
    }, { 'name': 'Thursday', 'data': [13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 10, 11, 12, 12, 13, 19, 38, 55, 50, 45, 43] }, { 'name': 'Friday', 'data': [24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 11, 14, 17, 20, 28, 50, 82, 100, 96, 84, 62] }, { 'name': 'Saturday', 'data': [34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 18, 28, 38, 47, 57, 68, 79, 85, 81, 67, 47] }, { 'name': 'Sunday', 'data': [28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 21, 26, 34, 44, 56, 65, 71, 73, 70, 57, 36] }], 'time_wait': [{
        'name': 'Monday', 'data': [15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0]
    }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 15, 15, 15, 15, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 30, 45, 45, 60, 45, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 30, 30, 30, 30, 30, 15] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 30, 30, 45, 45, 30, 0] }], 'time_spent': [90, 150]
}, {
    'id': 'ChIJS6AQBOXHwoARti6dg2BW694', 'name': 'Greenleaf Kitchen & Cocktails', 'address': '929 West Jefferson Boulevard #1650, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.02474309999999, 'lng': -118.285642 }, 'rating': 4.4, 'rating_n': 184, 'current_popularity': 22, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 42, 69, 70, 54, 45, 52, 61, 64, 57, 41, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 39, 76, 67, 48, 52, 64, 70, 69, 60, 46, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 83, 60, 26, 38, 64, 89, 99, 87, 61, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 39, 72, 84, 66, 51, 55, 70, 83, 84, 72, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 70, 100, 91, 68, 65, 75, 81, 75, 59, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 31, 44, 54, 56, 56, 60, 71, 71, 53, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18, 29, 39, 44, 46, 48, 55, 65, 68, 57, 0, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 15, 0, 0, 0, 15, 15, 0, 0, 0, 0] }, {
        'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }]
}, {
    'id':
        'ChIJNRRxXezHwoARycaDMem45cQ', 'name': 'Bacari W. Adams', 'address': '2308 South Union Avenue, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.03450139999999, 'lng': -118.2834681 }, 'rating': 4.3, 'rating_n': 270, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 17, 24, 21, 13, 0, 0] }, {
            'name': 'Tuesday', 'data': [0,
                0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 7, 19, 26, 21, 0, 0]
        }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23, 40, 52, 51, 38, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 51, 74, 84, 74, 51, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46, 73, 81, 76, 78, 80, 0] }, {
            'name': 'Saturday', 'data': [0, 0,
                0, 0, 0, 0, 0, 0, 0, 0, 12, 21, 30, 37, 41, 0, 0, 47, 62, 83, 100, 97, 76, 0]
        }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 14, 25, 22, 9, 0, 0, 17, 35, 52, 60, 50, 0, 0] }], 'time_spent': [60, 150]
}, {
    'id': 'ChIJ2Z271jHHwoARrj67f1zrNVo', 'name': 'Q Karaoke La 큐노래방 한타', 'address': '2500 West 8th Street Unit 104, Los Angeles', 'types': ['night_club', 'bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.05657189999999, 'lng': -118.2824554 }, 'rating': 4.4, 'rating_n': 27, 'populartimes': [{ 'name': 'Monday', 'data': [31, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 4, 9, 15, 17] }, { 'name': 'Tuesday', 'data': [13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 13, 28, 36, 36, 36] }, { 'name': 'Wednesday', 'data': [30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 10, 17, 25, 31, 32] }, { 'name': 'Thursday', 'data': [28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 10, 22, 37, 47, 45] }, {
        'name': 'Friday', 'data': [32, 17, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 21, 38, 56, 67, 72]
    }, { 'name': 'Saturday', 'data': [82, 76, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 26, 57, 88, 100, 94] }, { 'name': 'Sunday', 'data': [84, 68, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 11, 24, 36, 41, 38] }], 'time_spent': [90, 180]
}, {
    'id': 'ChIJieGyj-HHwoARK-hwrwbi76E', 'name': "McKay's", 'address': '3540 South Figueroa Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.01956679999999, 'lng': -118.280985 }, 'rating': 4.1, 'rating_n': 172, 'current_popularity': 41, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 6, 10, 15, 23, 29, 33, 35, 33, 35, 41, 55, 67, 67,
            52, 29, 0, 0]
    }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 7, 18, 40, 64, 80, 76, 56, 40, 41, 38, 24, 20, 23, 23, 16, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 12, 23, 27, 24, 35, 60, 38, 18, 23, 32, 36, 33, 24, 15, 7, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 4, 12, 26, 44, 61, 67, 61, 46, 36, 38, 50, 58, 52, 33, 16, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 12, 21, 32, 41, 46, 44, 38, 38, 50, 75, 89, 75, 44, 18, 52, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 6, 15, 26, 41, 53, 61, 64, 69, 78, 92, 100, 92, 72, 46, 24, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 7, 12, 18, 26, 33, 40, 43, 43, 38, 32, 24, 16, 10, 6, 3, 0, 0] }], 'time_spent': [60, 120]
}, {
    'id': 'ChIJcfe-Gw7IwoAR1EV2vfD2aow', 'name': 'El Sazon Ktracho', 'address': '4181 South Figueroa Street, Los Angeles', 'types':
        ['bar', 'restaurant', 'point_of_interest', 'food', 'establishment'], 'coordinates': { 'lat': 34.0073349, 'lng': -118.2829049 }, 'rating': 4.1, 'rating_n': 761, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 11, 22, 35, 49, 60, 66, 63, 54, 43, 40, 45, 52, 46, 28, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 1, 14, 30, 31, 31, 47, 57, 47, 38, 44, 56, 61, 54, 39, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 13, 22, 30, 35, 38, 40, 42, 41, 39, 38, 43, 51, 54, 44, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 14, 23, 32, 39, 42, 41, 37, 35, 35, 38, 41, 43, 39, 31, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 18, 25, 34, 41, 46, 47, 45, 40, 37, 43, 60, 76, 74, 51, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 11, 20, 33, 50, 66, 75, 74, 67, 62, 61, 63, 63, 58, 46, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 11, 26, 49, 74, 92, 100, 96, 90, 87, 87, 83, 73, 55, 35, 0, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
            'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                0, 0]
        }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
            'name': 'Friday', 'data': [0, 0,
                0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
        }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 0, 0, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 30, 30, 30, 15, 15, 15, 15, 0, 0, 0, 0] }], 'time_spent': [15, 60]
}, {
    'id': 'ChIJXdx3P3bHwoARYIXktB-_D7k', 'name': 'Silver Platter', 'address': '2700 West 7th Street, Los Angeles', 'types': ['bar', 'night_club', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.05923899999999, 'lng': -118.283543 }, 'rating': 3.9, 'rating_n': 81, 'current_popularity': 3, 'populartimes': [{ 'name': 'Monday', 'data': [49, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 3, 5, 6, 8, 10, 11, 13, 14, 14, 14, 13] }, { 'name': 'Tuesday', 'data': [12, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 2, 3, 6, 12, 20, 23, 19, 13, 12] }, { 'name': 'Wednesday', 'data': [12, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 3, 3, 4, 6, 8, 10, 13, 15, 16, 16, 16] }, {
        'name': 'Thursday', 'data': [14, 11, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 4, 4, 5, 6, 6, 8, 12, 20, 25, 23, 18, 18]
    }, { 'name': 'Friday', 'data': [19, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 3, 4, 5, 7, 12, 21, 37, 53, 60, 54, 48] }, { 'name': 'Saturday', 'data': [54, 52, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 6, 7, 9, 12, 18, 29, 48, 72, 86, 82, 76] }, { 'name': 'Sunday', 'data': [92, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 6, 9, 14, 21, 29, 39, 46, 50, 50, 49, 50] }]
}, {
    'id': 'ChIJTUtPz1bHwoARxfhZXhvzisU', 'name': "Rock & Reilly's USC Village - Restaurant & Bar - Dine-in & Outdoor Dining", 'address': '3201 South Hoover Street, Los Angeles', 'types': ['meal_takeaway', 'bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0242344, 'lng': -118.2840919 },
    'rating': 4.1, 'rating_n': 394, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18, 22, 23, 26, 37, 51, 54, 52, 52, 43, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 21, 24, 28, 35, 48, 59, 61, 65, 64, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 22, 25, 26, 37, 60, 69, 55, 45, 43, 37, 26] }, { 'name': 'Thursday', 'data': [14, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19, 24, 27, 28, 45, 100, 93, 47, 58, 82, 81, 54] }, { 'name': 'Friday', 'data': [23, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 24, 36, 50, 64, 76, 83, 85, 81, 71, 63, 76, 97] }, { 'name': 'Saturday', 'data': [59, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 32, 44, 55, 61, 67, 73, 74, 69, 65, 79, 99, 89] }, { 'name': 'Sunday', 'data': [48, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 31, 46, 55, 56, 51, 44, 39, 37, 34, 28, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0, 15, 15, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 30, 15, 15, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 30, 30, 15, 15, 15, 0, 0] }, {
        'name':
            'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 15, 30, 30, 15, 15, 15, 15, 15]
    }, { 'name': 'Saturday', 'data': [0, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }]
}, {
    'id': 'ChIJX1NVnOHHwoARNeXgS3YaVTM', 'name': 'The Lab Gastropub', 'address': '3500 South Figueroa Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0199351, 'lng': -118.2809083 }, 'rating': 4.1, 'rating_n': 522, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 24, 36, 43, 41, 31, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 27, 40, 37, 21, 12, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 27, 44, 58, 57, 41, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 47, 79, 98, 91, 67, 42, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 65, 87, 100, 97, 81, 58, 0, 0, 0] }, {
        'name': 'Sunday', 'data': [0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }], 'time_spent': [45, 120]
}, {
    'id': 'ChIJw0GQn3LHwoAR7uNvhlvvRoU', 'name': 'Crawfords', 'address': '2616 Beverly Boulevard, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.06959390000001, 'lng': -118.2775033 }, 'rating': 4.6, 'rating_n': 377, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 30, 37, 41, 44, 42, 29, 0]
    }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 17, 26, 34, 37, 35, 29, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 14, 30, 51, 73, 83, 66, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 21, 39, 56, 68, 68, 56, 0] }, {
        'name': 'Friday', 'data': [0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 23, 45, 66, 78, 88, 100, 96]
    }, {
        'name': 'Saturday', 'data': [65, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 11, 32, 37, 37, 57, 79, 86, 75]
    }, { 'name': 'Sunday', 'data': [51, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 37, 54, 64, 70, 70, 53, 0] }]
}, {
    'id': 'ChIJawC-cufHwoAREP1nD97S9ys', 'name': '901 Bar and Grill', 'address': '2902 South Figueroa Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.025583, 'lng': -118.2773206 }, 'rating': 4.3, 'rating_n': 545, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 15, 32, 55, 70, 64, 43, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 25, 32, 39, 45, 43, 31, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23, 34, 45, 54, 59, 60, 62, 69, 76] }, { 'name': 'Thursday', 'data': [70, 47, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19, 35, 56, 78, 95, 100, 91, 72, 50] }, { 'name': 'Friday', 'data': [30, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 24, 48, 75, 91, 89, 83, 87, 93, 81] }, { 'name': 'Saturday', 'data': [52, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 17, 26, 36, 47, 55, 61, 62, 61, 66, 79, 95, 97] }, { 'name': 'Sunday', 'data': [78, 48, 0, 0, 0, 0, 0, 0, 0, 0, 17, 25, 32, 40, 46, 50, 51, 52, 58, 65, 63, 47, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15,
            0, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 30, 30, 15, 15, 15, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, 15] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [45, 150]
}, {
    'id': 'ChIJaTIQh4HHwoARIneRlUMZUw0', 'name': 'Tirebiter Brewery', 'address': '2502 South Figueroa Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0286082, 'lng': -118.275038 }, 'rating': 4.8, 'rating_n': 82, 'populartimes':
        [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
            'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 17,
                29, 34, 29, 17, 0, 0]
        }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 22, 54, 75, 83, 81, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 31, 46, 54, 96, 100, 55, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 30, 55, 78, 88, 78, 55, 31, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 15, 22, 26, 22, 0, 0, 0, 0, 0] }]
}, {
    'id': 'ChIJr6I7Wt3HwoARR6bmqQKqjT8', 'name': 'Dirt Dog Inc.', 'address': '2528 South Figueroa Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.028291, 'lng': -118.2751606 }, 'rating': 4.6, 'rating_n': 4336, 'current_popularity': 27, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 44, 53, 54, 48, 42, 40, 43, 47, 46, 40, 30, 19, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 23, 43, 56, 54, 46, 47, 57, 67, 69, 59, 41, 24, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 21, 37, 58, 75, 79, 67, 49, 40, 43, 52, 56, 49, 32, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 24, 41, 58, 69, 71, 68, 67, 69, 72, 69, 58, 41, 24, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 42, 66, 85, 89, 79, 67, 69, 83, 87, 67, 43, 49, 72, 53] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 50, 75, 91, 97, 97, 98, 96, 86, 76, 74, 78, 72, 53] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 22, 40, 63, 86, 100, 99, 86, 71, 60, 56, 53, 48, 38, 26] }],
    'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 15, 15, 15, 15, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, 15, 15, 0, 15, 0] }], 'time_spent': [20, 45]
}, { 'id': 'ChIJ34n9F-fHwoARchKQEMKPPnA', 'name': 'Viztango Cafe', 'address': '3017 South Figueroa Street, Los Angeles', 'types': ['cafe', 'bar', 'meal_delivery', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0249113, 'lng': -118.278587 }, 'rating': 4.1, 'rating_n': 333, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 67, 81, 91, 98, 98, 84, 62, 36, 15, 3, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 56, 50, 50, 50, 46, 41, 39, 41, 37, 25, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 43, 65, 79, 70, 44, 25, 20, 27, 29, 22, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 67, 84, 68, 56, 63, 82, 96, 100, 91, 74, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 53, 56, 55, 48, 41, 37, 46, 70, 77, 51, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 12, 20, 34, 48, 63, 74, 79, 75, 65, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 12, 20, 31, 44, 58, 67, 70, 65, 53, 0, 0, 0] }], 'time_spent': [15, 45] }, {
    'id': 'ChIJ0ygfX7jHwoARYDiRSxiTL4A', 'name': 'Hyde Lounge at Crypto.com Arena', 'address': '1111 South Figueroa Street, Los Angeles', 'types': ['night_club', 'bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.04290340000001, 'lng': -118.2677485 }, 'rating': 4.2, 'rating_n': 62, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 9, 16, 22, 20, 12, 0]
    }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 14, 27, 31, 18, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 31, 48, 48, 31, 0] }, {
        'name': 'Thursday', 'data': [0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 61, 88, 96, 46, 0]
    }, {
        'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 18, 38, 53, 46, 25, 0]
    }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 75, 100, 87, 46, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 51, 74, 57, 24, 5, 0] }]
}, {
    'id': 'ChIJkwZR0rrHwoARNK40kUjCEfo', 'name': 'Monty Bar', 'address': '1222 West 7th Street, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0516034, 'lng': -118.2667803 }, 'rating': 4.5, 'rating_n': 213, 'populartimes': [{
        'name': 'Monday', 'data': [22, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3]
    }, { 'name': 'Tuesday', 'data': [3, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 9, 5, 8] }, { 'name': 'Wednesday', 'data': [10, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 11, 15, 16] }, { 'name': 'Thursday', 'data': [15, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 7, 11, 17, 25, 32, 37] }, { 'name': 'Friday', 'data': [34, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 4, 8, 18, 35, 52, 59] }, { 'name': 'Saturday', 'data': [51, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 36, 55, 70, 86] }, { 'name': 'Sunday', 'data': [100, 82, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 15, 22, 24] }], 'time_spent': [60, 180]
}, {
    'id': 'ChIJwddnArrHwoARDNgdrYwuxQg', 'name': '18 Social', 'address': '899 Francisco Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0471954, 'lng': -118.2645334 }, 'rating': 4.4, 'rating_n': 54, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] },
    { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 32, 53, 77, 96, 100] }, {
        'name': 'Saturday', 'data': [88, 65, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 33, 47, 61, 70, 73]
    }, { 'name': 'Sunday', 'data': [68, 56, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }]
}, {
    'id': 'ChIJpdRxjrnHwoARl0tefp4Cl5Q', 'name': 'El Sazón Ktracho No. 3', 'address': '1825 South Main Street, Los Angeles', 'types': ['bar', 'restaurant', 'point_of_interest', 'food', 'establishment'], 'coordinates': { 'lat': 34.0316839, 'lng': -118.2644249 }, 'rating': 4.4, 'rating_n': 106, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 11, 21, 32, 42, 47, 45, 39, 29, 27, 49, 73, 60, 39, 34, 32, 26, 16] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 6, 11, 24, 40, 57, 59, 47, 32, 24, 26, 36, 44, 47, 45, 36, 24, 14] }, {
        'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0,
            0, 1, 8, 19, 31, 42, 45, 42, 36, 40, 62, 63, 50, 47, 52, 50, 42, 29]
    }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 11, 19, 27, 34, 36, 32,
            29, 29, 32, 37, 45, 52, 55, 55, 50, 42, 32]
    }, {
        'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 4, 13, 26, 40, 54, 60, 59, 54, 45, 42, 42, 47, 52,
            55, 55, 50, 42]
    }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 1, 11, 36, 67, 86, 83, 59, 36, 27, 34, 50, 70, 83, 88, 80, 63, 42] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 11, 27, 49, 72, 90, 100, 98, 86, 72, 63, 65, 73, 81, 83, 75, 59, 39] }], 'time_spent': [20, 90]
}, {
    'id': 'ChIJBQ2mHKXHwoARmMdRAsLDkqQ', 'name': 'La Parrilla Restaurant - DTLA', 'address': '1300 Wilshire Boulevard, Los Angeles', 'types': ['bar', 'restaurant', 'point_of_interest', 'food', 'establishment'], 'coordinates': { 'lat': 34.0537169, 'lng': -118.2669068 }, 'rating': 3.8, 'rating_n': 679, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 42, 47, 43, 42, 46, 47, 40, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 41, 59, 59, 50, 47, 49, 48, 41, 0, 0, 0, 0, 0] }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 45, 51, 32, 26, 45, 58, 45, 0,
            0, 0, 0, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 46, 71, 54, 29, 31, 51, 69, 68, 0, 0, 0, 0] }, {
        'name': 'Saturday',
        'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 58, 76, 76, 67, 66, 68, 68, 64, 0, 0, 0, 0]
    }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 34, 59, 80, 91, 96, 100, 93, 73, 0, 0, 0, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 15, 15, 15, 15, 0, 0, 0, 0, 0, 0] }], 'time_spent': [60, 90]
}, { 'id': 'ChIJr2FBKbjHwoARXplMuhu6egc', 'name': 'Lucky Strike LA Live', 'address': '800 West Olympic Boulevard Ste 250, Los Angeles', 'types': ['bowling_alley', 'night_club', 'bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0447954, 'lng': -118.2652703 }, 'rating': 4.3, 'rating_n': 784, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 15, 18, 19, 17, 13, 9, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 21, 26, 26, 20, 12, 4, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 21, 24, 25, 22, 17, 11, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 31, 40, 43, 39, 29, 18, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 3, 10, 23, 41, 58, 72, 79, 79, 68] }, { 'name': 'Saturday', 'data': [48, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 10, 17, 25, 34, 42, 50, 57, 71, 90, 100, 84] }, { 'name': 'Sunday', 'data': [53, 27, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 2, 7, 15, 25, 35, 44, 51, 53, 46, 30, 0] }], 'time_spent': [90, 210] }, {
    'id': 'ChIJ7S3wRbjHwoARtVvNgmTa48E', 'name': 'Impact Bar & Grill', 'address': '1111 South Figueroa Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0434718, 'lng': -118.2661242 }, 'rating': 3.7, 'rating_n': 3, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 20, 37, 37, 20, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 22, 50, 52, 29, 16, 12, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 4, 0, 0, 2, 10, 35, 70, 97, 87, 52, 20, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 16, 45, 83, 100, 89, 64, 33, 10, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 10, 50, 100, 89, 56, 64, 33, 0] }, {
        'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 27, 25, 18, 14, 20,
            39, 68, 89, 89, 64, 35, 0]
    }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 35, 31, 22, 33, 56, 75, 72, 52, 27, 10, 2, 0] }]
}, {
    'id': 'ChIJG5wBgrfHwoARO_TfGQqe4xM', 'name': 'Fleming’s Prime Steakhouse & Wine Bar', 'address': '800 West Olympic Boulevard Suite A-135, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.04484659999999, 'lng': -118.2644713 }, 'rating': 4.4, 'rating_n': 1241, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 7, 19, 31, 34, 26, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 9, 11, 9, 9, 18, 38, 62, 73, 62, 38, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 5, 7, 9, 13, 22, 38, 56, 65, 56, 36, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 7, 10, 14, 23, 38, 56, 72, 76, 65, 45, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 5, 9, 11, 16, 28, 52, 81, 99, 94, 68, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 3, 6, 13, 26, 46, 68, 87, 100, 96, 71, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 55, 62, 51, 43, 43, 0, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0] }, {
        'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 30, 30,
            0, 0, 0]
    }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [90, 150]
}, {
    'id': 'ChIJkVW2qrnHwoARt_ZTFSxyS00', 'name': "Tom's Watch Bar - Los Angeles", 'address': '1011 South Figueroa Street b101, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0439289, 'lng': -118.2652624 }, 'rating': 3.9, 'rating_n': 1795, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19, 24, 28, 29, 25, 18, 10, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 24, 26, 26, 24, 18, 13, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 22, 25, 29, 31, 30, 26, 20, 0] }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 29,
            38, 45, 49, 47, 40, 29, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 35, 46, 59, 66, 65, 57, 43, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 22, 31, 38, 44, 50, 60, 74, 89, 100, 99, 89, 75, 62, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 36, 51, 62, 69, 73, 73, 72, 70, 66, 59, 49, 38, 26, 0] }]
}, {
    'id': 'ChIJG5wBgrfHwoARj_V1a6PV9SQ', 'name': 'Yard House', 'address': '800 West Olympic Boulevard A-115, Los Angeles', 'types': ['bar', 'meal_takeaway', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.04510449999999, 'lng': -118.2656611 }, 'rating': 4.4, 'rating_n': 5679, 'populartimes': [{ 'name': 'Monday', 'data': [16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 17, 21, 24, 26, 29, 37, 46, 48, 44, 41, 37, 27] }, { 'name': 'Tuesday', 'data': [15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 16, 20, 23, 26, 34, 45, 51, 47, 44, 46, 43, 28] }, { 'name': 'Wednesday', 'data': [11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 17, 21, 23, 23, 29, 42, 52, 48, 44, 46, 45, 34] }, { 'name': 'Thursday', 'data': [19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 21, 28, 34, 39, 45, 53, 63, 67, 61, 53, 55, 54] }, { 'name': 'Friday', 'data': [32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 23, 30, 36, 42, 55, 75, 94, 100, 93, 91, 99, 94] }, { 'name': 'Saturday', 'data': [66, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18, 29, 40, 50, 58, 69, 80, 88, 88, 83, 84, 93, 91] }, { 'name': 'Sunday', 'data': [64, 29, 0, 0, 0, 0, 0, 0, 0, 0, 9, 19, 32, 45, 53, 59, 68, 78, 75, 64, 61, 65, 59, 37] }], 'time_wait': [{ 'name': 'Monday', 'data': [15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 15, 15, 0, 0, 0, 15, 15, 15, 15, 0, 15] }, { 'name': 'Tuesday', 'data': [15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 30, 15, 0, 0, 0, 15, 15, 15, 30, 15, 0] }, { 'name': 'Wednesday', 'data': [15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 30, 15, 0, 0, 15, 30, 30, 30, 30, 15, 15] }, { 'name': 'Thursday', 'data': [15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 0, 15, 30, 45, 45, 45, 45, 30, 30] }, { 'name': 'Friday', 'data': [15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 0, 45, 30, 15, 30, 60, 60, 75, 75, 60, 60, 60] }, { 'name': 'Saturday', 'data': [30, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 30, 30, 45, 60, 60, 75, 60, 60, 60, 60, 45] }, {
        'name': 'Sunday', 'data': [45, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 30, 30, 45, 45, 45, 45, 45, 30, 30,
            30, 30]
    }], 'time_spent': [60, 120]
}, {
    'id': 'ChIJuYQ2SbjHwoARC4aaAnD6xp0', 'name': 'L.A. Live', 'address': 'Lucky Strike Bowling - Los Angeles, 800 West Olympic Boulevard, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0447508, 'lng': -118.2653642 }, 'rating': 4.3, 'rating_n': 784, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 15, 18, 19, 17, 13, 9, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 21, 26, 26, 20, 12, 4, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 21, 24, 25, 22, 17, 11, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 31, 40, 43, 39, 29, 18, 0] }, {
        'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 3, 10, 23, 41,
            58, 72, 79, 79, 68]
    }, { 'name': 'Saturday', 'data': [48, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 10, 17, 25, 34, 42, 50, 57, 71, 90, 100, 84] }, { 'name': 'Sunday', 'data': [53, 27, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 2, 7, 15, 25, 35, 44, 51, 53, 46, 30, 0] }], 'time_spent': [90, 210]
}, {
    'id': 'ChIJyQeiBKvHwoARJMxnD4NbFXA', 'name': 'La Casita', 'address': '939 South Figueroa Street, Los Angeles', 'types': ['bar', 'night_club', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.045529, 'lng': -118.2640141 }, 'rating': 4.4, 'rating_n': 49, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 17, 22, 27, 31, 34, 37, 39, 38, 33] }, { 'name': 'Saturday', 'data': [24, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 6, 11, 19, 30, 45, 65, 86, 100, 96, 77, 60, 72] }, { 'name': 'Sunday', 'data': [72, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 7, 11, 15, 20, 25, 29, 30, 28, 23, 17, 0, 0] }], 'time_spent': [90, 180]
}, {
    'id': 'ChIJtRNHuw7HwoARhA2ujvI-1gU', 'name': 'Sparrow', 'address': '939 South Figueroa Street Suite 200, Los Angeles', 'types': ['restaurant', 'bar', 'night_club', 'food', 'point_of_interest', 'establishment'], 'coordinates': {
        'lat':
            34.045529, 'lng': -118.2640141
    }, 'rating': 4, 'rating_n': 91, 'current_popularity': 100, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 43, 59, 63, 45, 0, 0]
    }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 33, 54, 65, 56, 36, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 36, 53, 66, 68, 56, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19, 40, 63, 72, 62, 41, 0] }, {
        'name': 'Friday', 'data': [0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46, 68, 84, 91, 86, 69, 49]
    }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 22, 34, 34, 26, 21, 30, 49, 71, 90, 98, 91, 72, 50] }, {
        'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 35, 34, 26, 24, 34, 58, 85, 100, 90, 64, 0,
            0]
    }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [90, 150]
}, { 'id': 'ChIJ__8vhrfHwoARNvEmZAQoRnY', 'name': 'Nixo Patio Lounge', 'address': '1020 South Figueroa Street, Los Angeles', 'types': ['night_club', 'bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0444546, 'lng': -118.2642214 }, 'rating': 4, 'rating_n': 58, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 52, 80, 65, 35, 20, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 45, 50, 27, 7, 2, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 60, 85, 90, 72, 42, 17, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 37, 65, 80, 75, 65, 65, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 75, 100, 75, 65, 67, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27, 35, 30, 47, 50, 17, 0] }] }, {
    'id': 'ChIJNRYSv8jHwoARe5CQvomkKH0', 'name': 'First Draft Taproom & Kitchen', 'address': '1230 South Olive Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0383626, 'lng': -118.2629886 }, 'rating': 4.5, 'rating_n': 270, 'current_popularity': 9, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 20, 29, 32, 25, 14, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 52, 71, 67, 43, 19, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 32, 53, 70, 74, 62, 42, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 44, 76, 98, 100, 88, 72, 50, 25] }, {
        'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 12,
            21, 35, 49, 63, 75, 84, 88, 88, 83, 73, 60, 45]
    }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 21, 35, 38, 35, 43, 62, 78, 80, 69, 0, 0, 0, 0] }], 'time_spent': [45, 120]
}, {
    'id': 'ChIJMQFUGMjHwoARgEq6zClzjVw', 'name': 'Prank Bar', 'address': '1100 South Hope Street, Los Angeles', 'types': ['restaurant', 'bar', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0419977, 'lng': -118.2630147 }, 'rating': 4.4, 'rating_n': 572, 'current_popularity': 33, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 26, 34, 34, 26, 15, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 54, 73, 79, 69, 48, 28, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 66, 95, 85, 64, 61, 49, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 87, 68, 65, 69, 45] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 52, 78, 79, 69, 67, 65, 52] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 35, 45, 56, 65, 72, 76, 80, 87, 96, 100, 90, 68] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 45, 57, 62, 62, 64, 69, 71, 68, 57, 43, 28, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 30, 30, 30, 15, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 30, 30, 30, 15, 15, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 30, 30, 30, 30, 30, 15, 0] }, {
        'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 15, 15, 30, 30, 30, 30, 30, 30, 30, 30, 30, 15, 0]
    }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 30, 30, 30, 15, 15, 0, 0, 0] }]
}, {
    'id': 'ChIJ9WyHlLfHwoARc_0kqEVS0w4', 'name': 'Caña Rum Bar', 'address': '714 West Olympic Boulevard, Los Angeles',
    'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0441294, 'lng': -118.2632598 }, 'rating': 4.5, 'rating_n': 638, 'populartimes': [{ 'name': 'Monday', 'data': [14, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 10, 13, 17, 19] }, { 'name': 'Tuesday', 'data': [16, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 25, 40, 46, 40] }, { 'name': 'Wednesday', 'data': [25, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 10, 17, 23, 23] }, { 'name': 'Thursday', 'data': [18, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 16, 24, 34, 43] }, { 'name': 'Friday', 'data': [39, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 13, 31, 56, 82] }, { 'name': 'Saturday', 'data': [100, 81, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 31, 63, 93] }, {
        'name': 'Sunday', 'data': [96, 68, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 33, 29, 23, 20]
    }], 'time_spent': [60, 150]
}, {
    'id': 'ChIJNXkfTC3HwoAR92DVIAWvMes', 'name': 'Strada Eateria & Bar', 'address': '825 James M Wood Boulevard #90015, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0465897, 'lng': -118.26333 }, 'rating': 4.6, 'rating_n': 229, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19, 25, 25, 21, 21, 30, 48, 64, 67, 54, 34, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19, 23, 25, 26, 26, 25, 36, 68, 76, 69, 63, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 38, 45, 44, 40, 48, 67, 86, 86, 65, 36, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 31, 38, 41, 44, 54, 73, 92, 100, 92, 71, 45, 0] }, {
        'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 65, 98, 96, 53, 57, 47, 0]
    }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 62, 65, 59, 63, 71, 78, 78, 70, 56, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0] }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 0, 0, 0,
            0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 15, 15, 15, 15, 15, 15, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0] }], 'time_spent': [60, 150]
}, {
    'id': 'ChIJ8dwoW6XHwoAR5gv7xgCA3Bc', 'name': 'The Capital Grille', 'address': '700 West 9th Street Unit B, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.04607219999999, 'lng': -118.2624906 }, 'rating': 4.6, 'rating_n': 176, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 16, 21, 21, 18, 19, 28, 42, 53, 52, 40, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 18, 22, 26, 35, 49, 65, 77, 85, 88, 73, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 26, 31, 29, 27, 32, 52, 76, 86, 73, 46, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 37, 49, 35, 23, 33, 53, 72, 78, 67, 46, 0, 0] }, {
        'name': 'Friday', 'data': [0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 18, 25, 29, 30, 30, 35, 50, 74, 93, 92, 70, 0, 0]
    }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27, 53, 80, 98, 100, 77, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 34, 49, 58, 56, 44, 0, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0, 15, 15, 15, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 15, 15, 15, 0, 0, 0] }, {
        'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0]
    }], 'time_spent': [90, 150]
}, {
    'id': 'ChIJQ3a0kMrHwoARz9TTMZiSNKI', 'name': 'Hanks Bar', 'address': '840 South Grand Avenue, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0448062, 'lng': -118.2586466 }, 'rating': 4, 'rating_n': 9, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 8, 22, 36, 41, 33, 19] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 16, 30, 47, 63, 69, 80] }, {
        'name': 'Saturday', 'data': [83, 33, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 30, 72, 72, 77, 100, 94]
    }, { 'name': 'Sunday', 'data': [63, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 16, 19, 25, 33, 30, 19] }]
}, {
    'id': 'ChIJwzfKrLbHwoARJrilSPACY_E', 'name': 'Wokcano', 'address': '800 West 7th Street, Los Angeles', 'types': ['bar', 'restaurant', 'point_of_interest', 'food', 'establishment'], 'coordinates': { 'lat': 34.0486865, 'lng': -118.2590467 }, 'rating': 4.3, 'rating_n': 1675, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 26, 32, 31, 31, 36, 44, 50, 48, 39, 27, 15] },
    { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 38, 39, 23, 20, 29, 40, 48, 50, 46, 37, 26, 15] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 33, 39, 44, 49, 54, 59, 60, 58, 51, 40, 27] }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 41, 41, 27, 31, 44, 60, 73, 79, 78, 68, 53, 37]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 26, 32, 39, 49, 62, 76, 88, 94, 91, 78, 60] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 14, 28, 45, 63, 79, 91, 98, 100, 91, 70, 44] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 14, 26, 41, 54, 63, 68, 70, 68, 61, 47, 30] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 30, 30, 15, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 0] }]
}, {
    'id': 'ChIJlaKHGLHHwoARO_xtPvPtX8Y', 'name': 'California Pizza Kitchen at 7th Street', 'address': '735 South Figueroa Street, 7th Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.049038, 'lng': -118.260675 }, 'rating': 4.3, 'rating_n': 1472, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 46, 56, 52, 42, 36, 42, 53, 58, 50, 35, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 42, 56, 60, 54, 42, 33, 35, 47, 56, 47, 26, 0, 0] }, {
        'name': 'Wednesday', 'data': [0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 51, 54, 50, 41, 36, 42, 50, 50, 42, 28, 0, 0]
    }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 43, 57, 63, 59, 48, 40, 42, 53, 62, 57, 39, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 44, 59, 68, 70, 66, 63, 66, 76, 87, 87, 73, 49, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 35, 51, 64, 71, 71, 71, 74, 80, 85, 84, 70, 42, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27, 43, 60, 74, 85, 93, 99, 100, 90, 71, 47, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0] }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15,
            15, 15, 15, 0, 15, 0, 15, 0, 0, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 0, 0] }, {
        'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 15, 15, 15, 15, 15, 15, 15, 15, 0, 0]
    }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, 15, 15, 0, 0, 0] }], 'time_spent': [15, 60]
}, {
    'id': 'ChIJ42h6UbHHwoARx_WXk8LDpPo', 'name': '10e Restaurant', 'address': '811 West 7th Street, Los Angeles', 'types': ['bar', 'night_club', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.04898889999999, 'lng': -118.2589806 }, 'rating': 4.3, 'rating_n': 279, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 40, 55, 39, 23, 31, 39,
            33, 36, 26, 5, 0, 0]
    }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 55, 52, 26, 10, 17, 40, 59, 56, 33, 13, 0, 0] }, {
        'name':
            'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 49, 86, 39, 17, 39, 73, 100, 92, 60, 27, 0, 0]
    }, {
        'name': 'Thursday', 'data': [0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 31, 49, 43, 23, 11, 18, 43, 75, 92, 81, 50, 0, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 23, 40, 43, 28, 15, 18, 40, 71, 89, 78, 49, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 8, 18, 30, 34, 30, 26, 34, 56, 62, 40, 14, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 4, 5, 7, 10, 18, 27, 26, 13, 2, 0, 0] }], 'time_spent': [60, 150]
}, {
    'id': 'ChIJB-QGt4XHwoARLFm11PoAZnw', 'name': 'The Rooftop at The Wayfarer Downtown LA', 'address': '813 Flower Street, Los Angeles', 'types': ['restaurant', 'bar', 'lodging', 'point_of_interest', 'food', 'establishment'], 'coordinates': { 'lat': 34.0471338, 'lng': -118.2606329 }, 'rating': 3.8, 'rating_n': 258, 'current_popularity': 2, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 9, 14, 15, 13, 11, 15, 23, 31, 33, 26, 16, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 4, 6, 6, 7, 11, 19, 34, 53, 60, 50, 30, 0] }, {
        'name':
            'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 12, 14, 15, 16, 18, 24, 34, 43, 43, 32, 17, 0]
    }, {
        'name': 'Thursday', 'data': [0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 3, 6, 11, 16, 19, 21, 24, 32, 46, 54, 44, 23, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 16, 20, 24, 27, 31, 39, 55, 80, 99, 96, 71, 39] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 16, 21, 26, 29, 31, 36, 46, 62, 80, 96, 100, 77, 41] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 26, 40, 42, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [60, 150]
}, {
    'id': 'ChIJFZsLpFzHwoAR0IxyfswPkCY', 'name': 'Video Vortex', 'address': '700 West 7th Street u240, Los Angeles', 'types': ['clothing_store', 'electronics_store', 'home_goods_store', 'bar', 'restaurant', 'point_of_interest', 'store', 'food', 'establishment'], 'coordinates': { 'lat': 34.0483595, 'lng': -118.2587597 }, 'rating': 5, 'rating_n': 3, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 11, 28, 48, 57, 50, 30] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 13, 26, 26, 25, 23, 3] }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 5, 9, 13, 15, 11, 7]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 11, 23, 28, 23, 13, 5] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 5, 7, 9, 9, 7, 7, 23, 65, 100, 71, 23] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 11, 15, 13, 7, 3, 1, 1, 1] }]
}, {
    'id': 'ChIJrYL7oLbHwoARk3BZW-OOuW4', 'name': 'Alamo Drafthouse Cinema Downtown Los Angeles', 'address': '700 West 7th Street Unit U240, Los Angeles', 'types': ['movie_theater', 'clothing_store', 'electronics_store', 'home_goods_store', 'bar', 'restaurant', 'point_of_interest', 'store', 'food', 'establishment'], 'coordinates': { 'lat': 34.0480101, 'lng': -118.2591574 }, 'rating': 4.7, 'rating_n': 1125, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 13, 18, 22, 25, 27, 33, 44, 53, 49, 31, 14, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 10, 13, 16, 20, 24, 31, 42, 54, 52, 32, 13, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 14, 17, 19, 20, 21, 25, 38, 52, 50, 31, 11, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 18, 29, 42, 55, 64, 66, 58, 45, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 16, 23, 30, 37, 42, 47, 55, 67, 81, 87, 81, 65, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 31, 53, 69, 72, 68, 71, 83, 95, 100, 98, 90, 75, 0] }, {
        'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 28, 48, 64, 73, 73, 71, 74, 78, 77, 66, 48,
            29, 0]
    }]
}, {
    'id': 'ChIJc7wQPlLHwoARlkl5XhNgtm0', 'name': 'The Burrow', 'address': '821 Flower Street, Los Angeles', 'types': ['bar', 'restaurant', 'point_of_interest', 'food', 'establishment'], 'coordinates': { 'lat': 34.046899, 'lng': -118.260718 }, 'rating': 4.7, 'rating_n': 104, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Tuesday', 'data': [0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 18, 34, 47, 47, 34, 18]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 31, 9, 20, 47, 44, 17] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 18, 34, 36, 35, 29] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 19, 33, 49, 61, 63, 55] }, { 'name': 'Saturday', 'data': [39, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 24, 35, 41, 53, 82, 100] }, { 'name': 'Sunday', 'data': [76, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [60, 150]
}, {
    'id': 'ChIJW7-uAz_HwoARMlbFIRTXdx0', 'name': 'Lilly Rose', 'address': '813 Flower Street, Los Angeles', 'types': ['night_club', 'bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0472336, 'lng': -118.2608478 },
    'rating': 4.4, 'rating_n': 61, 'populartimes': [{ 'name': 'Monday', 'data': [3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 3, 1, 2, 0, 10, 15, 15, 3, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 3, 3, 3, 0, 1, 5, 13, 13, 6] }, { 'name': 'Friday', 'data': [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 3, 5, 5, 0, 13, 43, 82, 100, 99] }, {
        'name':
            'Saturday', 'data': [88, 58, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 40, 38, 23, 0, 20, 30, 38, 41, 36]
    }, { 'name': 'Sunday', 'data': [27, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 21, 15, 8, 0, 6, 7, 7, 9, 8] }], 'time_spent': [60, 150]
}, {
    'id': 'ChIJkXtGbC7HwoARayTVUm5YevQ', 'name': 'Marlou DTLA', 'address': '819 Flower Street, Los Angeles', 'types': ['cafe', 'bar', 'restaurant', 'point_of_interest', 'store', 'food', 'establishment'], 'coordinates': { 'lat': 34.0470551, 'lng': -118.2608535 }, 'rating': 4.6, 'rating_n': 72, 'current_popularity': 10, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 22, 23, 20, 16, 13, 14, 21, 32, 38, 35, 24, 0, 0] }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 2, 9, 16, 14, 7, 3, 7, 19, 35, 45, 40, 24, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 17, 17, 15, 13, 14, 20, 35, 54, 65, 59, 41, 20, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 18, 20, 17, 11, 9, 14, 30, 51, 64, 60, 41, 20, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 29, 33, 32, 26, 24, 30, 47, 68, 82, 81, 63, 40, 20] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 42, 66, 76, 70, 59, 59, 72, 88, 100, 100, 85, 58, 29] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 34, 64, 86, 83, 59, 36, 29, 36, 46, 48, 40, 26, 13, 5] }], 'time_spent': [60, 150]
}, {
    'id': 'ChIJ2fQSQ7HHwoAR_1kXpeHccbg', 'name': 'Engine Co. No. 28', 'address': '644 South Figueroa Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'],
    'coordinates': { 'lat': 34.0497471, 'lng': -118.2593775 }, 'rating': 4.1, 'rating_n': 531, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 20, 31, 28, 19, 18, 27, 40, 50, 52, 47, 34, 0, 0]
    }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 31, 37, 38, 33, 30, 35, 53, 77, 93, 90, 68, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 24, 39, 42, 32, 22, 24, 34, 45, 52, 50, 40, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 33, 29, 18, 20, 38, 60, 76, 77, 64, 41, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 35, 39, 28, 16, 16, 31, 54, 70, 64, 43, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 21, 31, 36, 38, 43, 53, 64, 68, 56, 37, 0, 0] }, {
        'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 16, 19, 18, 22, 40,
            71, 97, 100, 74, 39, 0, 0]
    }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] },
    { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Wednesday', 'data': [0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            15, 15, 0, 0, 0, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 15, 15, 15, 0, 15, 0, 0]
    }], 'time_spent': [60, 120]
}, {
    'id': 'ChIJ_48AUrHHwoARyoV0Rk_EjdU', 'name': "Dublin's Irish Whiskey Pub", 'address': '815 West 7th Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0491141, 'lng': -118.2590567 }, 'rating': 4.3, 'rating_n': 1108, 'current_popularity': 23, 'populartimes': [{ 'name': 'Monday', 'data': [53, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 9, 12, 15, 19, 26, 33, 41, 47, 49, 46, 44, 53] }, { 'name': 'Tuesday', 'data': [69, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 12, 16, 22, 28, 34, 38, 39, 37, 35, 35, 39, 42] }, { 'name': 'Wednesday', 'data': [41, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 9, 12, 16, 22, 29, 36, 42, 46, 46, 43, 45, 60] }, { 'name': 'Thursday', 'data': [70, 55, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 8, 11, 15, 22, 31, 42, 54, 62, 67, 65, 63, 70] }, { 'name': 'Friday', 'data': [80, 64, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 16, 20, 25, 30, 38, 48, 58, 67, 71, 70, 73, 86] }, {
        'name': 'Saturday', 'data': [100,
            87, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 14, 19, 27, 35, 43, 49, 52, 54, 58, 69, 85, 96]
    }, { 'name': 'Sunday', 'data': [93, 73, 0, 0, 0, 0, 0, 0, 0, 0, 0, 21, 28, 35, 42, 47, 51, 52, 52, 50, 48, 49, 52, 55] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0, 15, 15] }, { 'name': 'Friday', 'data': [15, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15] }, { 'name': 'Saturday', 'data': [15, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0, 0, 0, 0, 0, 15, 0, 15, 15] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }]
}, {
    'id': 'ChIJmbGqH7THwoAR1UfWzlucCek', 'name': 'District', 'address': 'Plaza Level in The Bloc, 700 West 7th Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'],
    'coordinates': { 'lat': 34.0480155, 'lng': -118.2583847 }, 'rating': 4.4, 'rating_n': 357, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0, 0,
            0, 0, 0, 2, 3, 5, 7, 8, 9, 9, 9, 9, 11, 17, 25, 32, 33, 26, 16, 0]
    }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 16, 33, 29, 10, 2, 18, 56, 41, 40, 56, 40, 13, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 2, 4, 2, 1, 8, 44, 46, 12, 9, 24, 48, 69, 74, 58, 33, 14, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 1, 4, 9, 17, 25, 28, 26, 22, 22, 33, 55, 77, 84, 68, 41, 19, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 1, 3, 0, 9, 14, 19, 24, 28, 36, 49, 61, 78, 100, 81, 35, 0] }, {
        'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 13,
            17, 2, 2, 5, 9, 16, 23, 30, 36, 42, 52, 60, 58, 43, 24, 0]
    }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 2, 7, 6, 4, 5, 9, 13, 17, 20, 22, 26, 31, 33, 29, 20, 10, 0] }], 'time_spent': [60, 120]
}, {
    'id': 'ChIJlw6Cp7bHwoARNs7p_-LeK_4', 'name': 'HATCH', 'address': '700 West 7th Street Suite G600, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.04807499999999, 'lng': -118.2581414 }, 'rating': 4.4, 'rating_n': 323, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27, 39, 41, 30, 15, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23, 26, 27, 27, 33, 46, 58, 56, 41, 21, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 23, 25, 25, 26, 33, 50, 63, 54, 30, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 31, 36, 40, 39, 37, 34, 39, 55, 62, 44, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 35, 40, 44, 49, 59, 77, 96, 100, 82, 51, 0] }, {
        'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 53, 77, 91, 86, 67,
            42, 0]
    }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 50, 59, 58, 48, 32, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [60, 120]
}, {
    'id': 'ChIJH5RmabHHwoARpcOaX49ZKdM', 'name': 'Spire 73', 'address': '900 Wilshire Boulevard fl 73, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.050511, 'lng': -118.2602511 }, 'rating': 4.1, 'rating_n': 763, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 23, 28, 31, 33, 33, 26] }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 22, 28, 34, 40, 42, 35, 21]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18, 31, 39, 41, 40, 33, 21] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 17, 28, 38, 43, 40, 30] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 33, 48, 57, 59, 61, 60, 46] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 41, 66, 87, 98, 100, 88, 62] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 48, 64, 74, 72, 59, 41, 24] }]
}, {
    'id': 'ChIJIT2TUbHHwoARh84e5OpXmrg', 'name': "Dublin's", 'address': '815 West 7th Street, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0491079, 'lng': -118.2591183 }, 'rating': 4.3, 'rating_n': 1108, 'current_popularity': 23, 'populartimes': [{ 'name': 'Monday', 'data': [53, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 9, 12, 15, 19, 26, 33, 41, 47, 49, 46, 44, 53] }, { 'name': 'Tuesday', 'data': [69, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 12, 16, 22, 28, 34, 38, 39, 37, 35, 35, 39, 42] }, {
        'name': 'Wednesday',
        'data': [41, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 9, 12, 16, 22, 29, 36, 42, 46, 46, 43, 45, 60]
    }, {
        'name': 'Thursday', 'data': [70, 55, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 6, 8, 11, 15, 22, 31, 42, 54, 62, 67, 65, 63, 70]
    }, {
        'name': 'Friday', 'data': [80, 64, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 16, 20, 25,
            30, 38, 48, 58, 67, 71, 70, 73, 86]
    }, { 'name': 'Saturday', 'data': [100, 87, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 14, 19, 27, 35, 43, 49, 52, 54, 58, 69, 85, 96] }, { 'name': 'Sunday', 'data': [93, 73, 0, 0, 0, 0, 0, 0, 0, 0, 0, 21, 28, 35, 42, 47, 51, 52, 52, 50, 48, 49, 52, 55] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0] }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0, 15, 15] }, { 'name': 'Friday', 'data': [15, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15] }, { 'name': 'Saturday', 'data': [15, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0, 0, 0, 0, 0, 15, 0, 15, 15] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }]
}, {
    'id': 'ChIJFV_xgLbHwoARMdc5sY4wPhA', 'name': 'Broken Shaker at Freehand Los Angeles', 'address': '416 West 8th Street, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0448177, 'lng': -118.2566613 }, 'rating': 4.2, 'rating_n': 652, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 5, 19, 25, 17, 14, 15, 15, 18, 22, 13, 3] }, {
        'name': 'Tuesday',
        'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 12, 10, 11, 20, 31, 35, 30, 24, 20, 15, 10]
    }, {
        'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 4, 5, 5, 7, 12, 23, 34, 36, 29, 17, 20, 28]
    }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 10, 17, 23, 25, 23, 27, 47, 70, 66] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 12, 17, 23, 27, 29, 29, 30, 42, 70, 100, 98] }, { 'name': 'Saturday', 'data': [64, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 15, 23, 32, 40, 44, 44, 40, 35, 41, 69, 100] }, {
        'name': 'Sunday', 'data': [87,
            43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 17, 26, 33, 35, 33, 28, 24, 24, 25, 22, 13]
    }], 'time_spent': [10, 90]
}, {
    'id': 'ChIJPTSn9srHwoAR_whrKoPx_Uo', 'name': 'Broadway Bar', 'address': '830 South Broadway, Los Angeles', 'types': ['bar', 'night_club', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0428699, 'lng': -118.2551748 }, 'rating': 4.2, 'rating_n': 366, 'populartimes': [{ 'name': 'Monday', 'data': [49, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 39, 39, 29, 18] }, { 'name': 'Thursday', 'data': [10, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 41, 40, 29, 21] }, { 'name': 'Friday', 'data': [17, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 38, 74, 100, 96, 75] }, { 'name': 'Saturday', 'data': [60, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23, 41, 56, 61, 55] }, { 'name': 'Sunday', 'data': [48, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 60, 75, 71, 64, 60] }], 'time_spent': [45, 150]
}, {
    'id': 'ChIJp6jJXTXHwoAR9LnnI4WV_EE', 'name': 'Good Clean Fun', 'address': '868 South Olive Street, Los Angeles', 'types': ['bar', 'liquor_store', 'store', 'restaurant', 'point_of_interest', 'food', 'establishment'], 'coordinates': { 'lat': 34.0438789, 'lng': -118.25775 }, 'rating':
        4.8, 'rating_n': 52, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 17, 32, 42, 44, 35, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 19, 41, 62, 69, 55, 32, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 21, 39, 96, 83, 64, 50, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 50, 75, 94, 100, 91, 69, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 33, 51, 66, 75, 82, 92, 71, 0] }, {
            'name': 'Sunday', 'data': [0, 0, 0, 0,
                0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
        }]
}, {
    'id': 'ChIJe2KRSsrHwoARkGEK_hY_z2I', 'name': 'Upstairs at Ace Hotel', 'address':
        '929 South Broadway, Los Angeles', 'types': ['bar', 'lodging', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0416667, 'lng': -118.2569444 }, 'rating': 4.4, 'rating_n': 673, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 9, 12, 13, 13, 14, 18, 22, 25, 22, 14, 7] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 8, 11, 15, 17, 19, 18, 15, 14, 20, 21, 9] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 6, 9, 13, 17, 21, 22, 22, 25, 30, 31, 20] }, {
            'name': 'Thursday', 'data': [0, 0, 0,
                0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 7, 9, 12, 14, 16, 17, 19, 22, 31, 43, 51]
        }, {
            'name': 'Friday', 'data': [46, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 8,
                12, 16, 19, 24, 29, 36, 44, 55, 71, 86]
        }, {
            'name': 'Saturday', 'data': [78, 47, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 10, 13, 15, 17, 22, 31, 42, 50, 54,
                62, 82, 100]
        }, { 'name': 'Sunday', 'data': [93, 61, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 13, 19, 23, 25, 27, 27, 25, 22, 23, 25, 23, 16] }], 'time_spent':
        [45, 120]
}, {
    'id': 'ChIJM1VsZlfHwoARJL0zwUZExbs', 'name': 'Zinqué - DTLA', 'address': '939 South Broadway, Los Angeles', 'types': ['cafe', 'bar',
        'store', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0415551, 'lng': -118.257114 }, 'rating': 4.3, 'rating_n': 284, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 4, 14, 27, 39, 48, 54, 54, 51, 47, 44, 42, 40, 38, 34, 29, 23, 0] },
        { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 9, 20, 30, 40, 46, 48, 48, 46, 45, 45, 46, 46, 44, 40, 31, 21, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 11, 17, 23, 30, 36, 39, 40, 38, 36, 36, 40, 47, 53, 51, 41, 27, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 9, 19, 31, 44, 51, 51, 44, 36, 31, 35, 44, 57, 67, 70, 66, 55, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 21, 31, 42, 50, 56, 58, 58, 57, 57, 62, 70, 82, 91, 95, 89, 76, 57] }, {
            'name': 'Saturday', 'data': [36, 0, 0, 0, 0, 0, 0, 4, 17, 34, 53, 67, 72, 67, 55, 42, 36, 40, 50, 61, 66,
                62, 52, 39]
        }, { 'name': 'Sunday', 'data': [27, 0, 0, 0, 0, 0, 0, 8, 21, 42, 69, 91, 100, 94, 85, 84, 89, 92, 87, 72, 51, 30, 14, 0] }]
}, {
    'id': 'ChIJPVlRz7PHwoAR-hbreIW_2zM', 'name': 'Drago Centro', 'address': '525 Flower Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.051234, 'lng': -118.257327 }, 'rating': 4.4, 'rating_n': 654, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 24, 29, 31, 32, 0, 0, 45, 63, 70, 57, 31, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 58, 63, 52, 0, 0, 66, 90, 100, 86, 58, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 37, 57, 60, 45, 0, 0, 45, 65, 76, 73, 57, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 42, 56, 55, 44, 0, 0, 65, 87, 99, 95, 76, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 36, 36, 30, 0, 0, 40, 53, 61, 59, 49, 0, 0] }, {
        'name': 'Saturday', 'data': [0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 52, 63, 61, 66, 63, 0, 0]
    }, {
        'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0]
    }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] },
    { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0, 0, 15, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [90, 150]
}, {
    'id': 'ChIJ_X3CRLLHwoARAaU7DsFaTJA', 'name': 'Bonaventure Brewing Co.', 'address': '404 South Figueroa Street Suite 418A (4th floor, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0529508, 'lng': -118.2562006 }, 'rating': 3.7, 'rating_n': 122, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 17, 19, 16, 10, 6, 6, 12, 18, 16, 10, 4, 0, 0]
    }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 23, 26, 26, 26, 28, 31, 31, 29, 25, 24, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 30, 27, 25, 28, 35, 41, 45, 45, 40, 32, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 36, 43, 44, 41, 38, 38, 40, 43, 43, 40, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 34, 45, 51, 51, 46, 42, 41, 45, 50, 53, 54, 50, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 35, 45, 54, 65, 77, 90, 100, 99, 86, 64, 42, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }]
}, {
    'id': 'ChIJd-OpVLTHwoARJ3fFiZG_xD4', 'name': 'Seven Grand', 'address': '515 West 7th Street 2nd floor, Los Angeles', 'types': ['bar', 'night_club', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0470275, 'lng': -118.2559336 }, 'rating': 4.6,
    'rating_n': 1577, 'populartimes': [{ 'name': 'Monday', 'data': [31, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 8, 13, 20, 26, 31, 35, 38, 36] },
    { 'name': 'Tuesday', 'data': [30, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 15, 21, 28, 33, 38, 41, 41, 37] }, { 'name': 'Wednesday', 'data': [30, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 10, 16, 22, 29, 34, 38, 42, 43] }, { 'name': 'Thursday', 'data': [37, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 10, 15, 23, 33, 43, 48, 48, 42] }, { 'name': 'Friday', 'data': [32, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 13, 20, 29, 39, 53, 69, 83, 86] }, { 'name': 'Saturday', 'data': [73, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 19, 31, 44, 54, 63, 76, 94, 100] }, { 'name': 'Sunday', 'data': [80, 46, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 16, 23, 27, 28, 30, 34, 38, 37] }], 'time_spent': [45, 150]
}, {
    'id': 'ChIJjzDWUMTHwoAR56sLfD-ywGQ', 'name': 'Gyu-Kaku Japanese BBQ', 'address': '514 West 7th Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.046734, 'lng': -118.2560723 }, 'rating': 4.5, 'rating_n': 40, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 17, 20, 14, 14, 28, 49, 66, 66, 49, 28, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 9, 17, 22, 24, 18, 14, 17, 33, 46, 38, 18, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 10, 18, 28, 34, 37, 37, 40, 53, 61, 46, 21, 0] }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 20, 49, 34, 8, 8, 28, 60, 81, 69, 37, 12,
            0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 4, 9, 20, 30, 40, 49, 68, 92, 96, 70, 36, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 22, 28, 32, 40, 46, 48, 58, 86, 100, 69, 28, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 5, 16, 28, 37, 46, 58, 69, 66, 49, 29, 13, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Sunday', 'data': [0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }], 'time_spent': [60, 120]
}, {
    'id': 'ChIJI9WjVLTHwoAR1jD5leBjYPw', 'name': 'Bar Jackalope', 'address': '515 West 7th Street #200, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0470535, 'lng': -118.255909 }, 'rating': 4.8, 'rating_n': 65, 'populartimes': [{
        'name': 'Monday', 'data': [12, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 16, 19, 21, 19, 14]
    }, { 'name': 'Tuesday', 'data': [7, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 19, 41, 50, 39] }, { 'name': 'Wednesday', 'data': [19, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 32, 55, 42, 46, 41] }, {
        'name': 'Thursday', 'data': [19, 3, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 48, 67, 73, 62]
    }, { 'name': 'Friday', 'data': [41, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 51, 83, 100, 91] }, { 'name': 'Saturday', 'data': [62, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 44, 55, 64, 78, 82] }, { 'name': 'Sunday', 'data': [62, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23, 39, 46, 41, 25] }]
}, { 'id': 'ChIJyRdwS2_HwoARyxMvsnsRLmU', 'name': 'Bar Clara', 'address': '649 South Olive Street, Los Angeles', 'types': ['bar', 'night_club', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0469978, 'lng': -118.2553544 }, 'rating': 3.8, 'rating_n': 17, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 12, 23, 36, 43, 41, 29, 21, 30, 30, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 14, 27, 40, 49, 54, 61, 80, 87, 58, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 14, 36, 63, 81, 83, 85, 94, 96, 76, 43, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 32, 56, 60, 52, 60, 81, 98, 100, 89, 83, 89, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 36, 47, 43, 45, 54, 61, 54, 38, 20, 9, 0, 0] }] }, {
    'id': 'ChIJ17oMz7XHwoAR0eQs7WQ-Seo', 'name': 'The Eight Bar', 'address': '788 South Grand Avenue, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0459251, 'lng': -118.2576111 }, 'rating': 4.1, 'rating_n': 93, 'populartimes': [{
        'name': 'Monday',
        'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 9, 15, 21, 31, 34, 31, 25, 15, 9, 0, 0, 0]
    }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 18, 18, 18, 18, 28, 34, 37, 34, 28, 25, 0, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 18, 34, 37, 34, 25, 31, 50, 53, 37, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 40, 34, 28, 25, 34, 40, 46, 50, 50, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18, 21, 25, 25, 25, 40, 81, 100, 65, 34, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 15, 31, 31, 28, 43, 65, 81, 75, 53, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 18, 37, 56, 62, 50, 31, 28, 40, 56, 0, 0, 0] }]
}, {
    'id': 'ChIJj7-rk0PHwoARoRsYRjeDg_8', 'name': 'Limericks Tavern DTLA', 'address': '615 Flower Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.04985489999999, 'lng': -118.2579139 }, 'rating': 4.2, 'rating_n': 206, 'current_popularity': 1, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 6, 5, 3, 7, 14, 21, 26, 28, 26, 19, 12, 6] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 11, 18, 14, 13, 24, 41, 56, 63, 60, 47, 31, 16] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 19, 23, 27, 31, 38, 52, 66, 64, 49, 38, 29, 21] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 4, 8, 12, 19, 36, 71, 100, 85, 56, 41, 33, 26] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 8, 14, 21, 29, 38, 46, 54, 59, 60, 57, 49, 39] }, { 'name': 'Saturday', 'data': [28, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 8, 15, 22, 27, 32, 39, 50, 63, 71, 66, 52, 34] }, {
        'name': 'Sunday', 'data': [21, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 6, 19, 19, 13, 20, 34, 46, 51, 45, 32, 18,
            7]
    }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0] }, {
        'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 15, 0, 0, 15, 0, 15, 15, 15, 0, 0]
    }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 15, 15, 15, 15, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 15, 0, 0, 0, 0, 15, 15, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [45, 120]
}, {
    'id': 'ChIJc6BaWc3HwoARjoG2U9gMA3Q', 'name': 'Rossoblu', 'address': '1124 San Julian Street, Los Angeles', 'types': ['liquor_store', 'bar', 'store', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.034925, 'lng': -118.2533583 }, 'rating': 4.6, 'rating_n': 744, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 34, 47, 50, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 21, 35, 46, 44, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27, 42, 50, 44, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 44, 53, 47, 0, 0, 0] }, {
        'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 35, 68, 94, 93, 64, 0, 0]
    }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 62, 93, 100, 91, 84, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 56, 58, 48, 0, 0, 0] }], 'time_wait': [{
        'name': 'Monday', 'data':
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name':
            'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 15, 15, 0, 0, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 30, 30, 15, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0, 0] }], 'time_spent': [90, 180]
}, {
    'id': 'ChIJi2n_QrTHwoARkgY9DE5o8q0', 'name': 'Karl Strauss Brewing Company', 'address': '600 Wilshire Boulevard Suite 100, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0479303, 'lng': -118.2562851 }, 'rating': 4.6, 'rating_n': 651, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 20, 30, 36, 40, 46, 46, 33, 0, 0, 0, 0] },
    { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 21, 25, 28, 29, 30, 38, 51, 57, 44, 0, 0, 0, 0] }, {
        'name': 'Wednesday', 'data': [0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 27, 33, 26, 29, 41, 51, 53, 45, 0, 0, 0, 0]
    }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19, 28, 34, 37, 37, 46, 74, 100, 86, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 25, 35, 44, 49, 49, 51, 63, 73, 56, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 20, 30, 42, 51, 53, 55, 61, 62, 47, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19, 22, 28, 38, 53, 66, 66, 50, 0, 0, 0, 0] }]
}, {
    'id': 'ChIJqxUvBbTHwoARTl73yPxPvO4', 'name': 'Shoo Shoo Baby', 'address': '717 West 7th Street, Los Angeles', 'types': ['bar', 'night_club', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0483803, 'lng': -118.2579674 }, 'rating': 4.5, 'rating_n': 279, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 16, 17, 21, 27, 30, 28] }, { 'name': 'Wednesday', 'data': [24, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 9, 18, 26, 30, 35, 41] }, { 'name': 'Thursday', 'data': [36, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 12, 15, 20, 30, 43, 49] }, { 'name': 'Friday', 'data': [43, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 18, 27, 35, 40, 48, 67] }, {
        'name': 'Saturday', 'data': [78, 55, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 22,
            26, 33, 54, 86]
    }, { 'name': 'Sunday', 'data': [100, 75, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [45, 150]
}, {
    'id': 'ChIJP0XXzpnHwoAR3rxS5t6diqY', 'name': 'DAMA Fashion District Restaurant & Bar', 'address': '612 East 11th Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0352912, 'lng': -118.2530507 }, 'rating': 4.6, 'rating_n': 561, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19, 32, 44, 46, 37, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 32, 41, 38, 34, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 27, 39, 42, 33, 0, 0] }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            22, 36, 49, 55, 48, 0, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 34, 60, 78, 74, 50, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 47, 74, 95, 100, 84, 58, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 15, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 30, 30, 30, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 45, 45, 45, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [90, 180]
}, {
    'id': 'ChIJu3POhnjHwoARQj4rt99wI5M', 'name': 'Tavern Off Broadway', 'address': '221 West 7th Street, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0450665, 'lng': -118.252877 }, 'rating': 4.8, 'rating_n': 28, 'populartimes': [{ 'name': 'Monday', 'data': [24, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 15, 24, 32, 39, 40, 36] }, { 'name': 'Tuesday', 'data': [29, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 39, 46, 43, 36, 36, 41] }, { 'name': 'Wednesday', 'data': [36, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19, 22, 27, 33, 34, 31, 28] }, {
        'name':
            'Thursday', 'data': [26, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 29, 36, 41, 43, 43, 44, 43]
    }, {
        'name': 'Friday', 'data': [36, 25, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 39, 50, 48, 44, 59, 89, 100]
    }, { 'name': 'Saturday', 'data': [98, 88, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 10, 17, 25, 34, 41, 46, 48, 56, 73, 95, 100] }, { 'name': 'Sunday', 'data': [78, 43, 0, 0, 0, 0, 0, 0, 0, 0, 2, 7, 17, 24, 20, 17, 19, 26, 29, 29, 26, 23, 23, 24] }]
}, {
    'id': 'ChIJU9oTm7THwoAR4jLN-PzGEUc', 'name': 'Checkers Downtown', 'address': '535 South Grand Avenue, Los Angeles', 'types': ['bar', 'restaurant', 'point_of_interest', 'food', 'establishment'], 'coordinates': { 'lat': 34.0495567, 'lng': -118.2549359 }, 'rating': 4.2, 'rating_n': 68, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 9, 30, 41, 30, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 1, 1, 2, 9, 11, 6, 5, 0, 0, 0, 15, 16, 15, 13, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 1, 1, 1, 11, 20, 22, 13, 2, 0, 0, 0, 5, 12, 19, 23, 0, 0, 0] }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 1, 1, 1, 4, 8, 12, 12, 9, 0, 0, 0, 36, 45,
            44, 37, 0, 0, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 1, 5, 9, 13, 16, 19, 22, 22, 0, 0, 0, 29, 40, 54, 66, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 1, 1, 5, 13, 22, 29, 31, 31, 0, 0, 0, 65, 87, 100, 97, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 1, 2, 20, 40, 55, 59, 51, 33, 0, 0, 0, 8, 18, 29, 36, 0, 0, 0] }]
}, { 'id': 'ChIJUZymwbTHwoAR1RJIniCE5vw', 'name': 'Pitchoun!', 'address': '545 South Olive Street, Los Angeles', 'types': ['bakery', 'bar', 'cafe', 'store', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.04852959999999, 'lng': -118.2539871 }, 'rating': 4.5, 'rating_n': 1133, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 14, 25, 35, 39, 36, 27, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 26, 41, 38, 37, 40, 38, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 36, 45, 37, 40, 47, 43, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 46, 55, 43, 41, 49, 48, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 39, 54, 64, 65, 57, 42, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 58, 92, 100, 88, 81, 71, 48, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 44, 72, 92, 92, 73, 44, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 30, 30, 15, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 15, 30, 30, 30, 30, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [25, 60] }, {
    'id': 'ChIJww7eN7PHwoARplLD_aQspDc', 'name': 'Pez Cantina', 'address': '401 South Grand Avenue, Los Angeles', 'types': ['bar', 'restaurant', 'point_of_interest', 'food', 'establishment'], 'coordinates': { 'lat': 34.05148159999999, 'lng': -118.2532981 }, 'rating': 4.2, 'rating_n': 910, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 10, 13, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 53, 74, 74, 60, 52, 58, 70, 76, 71, 56, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 71, 91, 90, 73, 58, 56, 63, 69, 67, 57, 0, 0, 0] }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 57, 63, 66, 66, 67, 70, 74, 77, 72, 59, 0, 0, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 44, 50, 54, 56, 56, 58, 68, 85, 100, 95, 70, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 44, 57, 64, 64, 62, 65, 74, 85, 91, 89, 78, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [60, 120]
}, {
    'id': 'ChIJy5RLmMvHwoAR_aX4-0MXF5I', 'name': 'Amante Restaurant', 'address': '123 East 9th Street, Los Angeles', 'types': ['meal_delivery', 'bar', 'restaurant', 'point_of_interest', 'food', 'establishment'], 'coordinates': { 'lat': 34.04113339999999, 'lng': -118.25421 }, 'rating': 4, 'rating_n': 401, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 36, 44, 48, 50, 48, 46, 48, 52, 52, 42, 26, 12, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 42, 54, 62, 62, 58, 50, 42, 34, 26, 20, 16, 12, 8, 0] }, {
        'name': 'Wednesday', 'data':
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 38, 54, 64, 66, 58, 50, 54, 68, 58, 38, 24, 14, 4, 0]
    }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 54, 66, 74, 76, 70, 62, 48, 36, 32, 52, 48, 16, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 52, 50, 48, 46, 50, 52, 52, 48, 40, 30, 22, 14, 8, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18, 22, 24, 22, 20, 16, 18, 32, 56, 80, 100, 88, 40, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 34, 54, 64, 52, 36, 46, 80, 70, 30, 22, 8, 0, 0] }]
}, {
    'id': 'ChIJ10BYf0vGwoARdzJAvD5BjaY', 'name': 'La Cita Bar', 'address': '336 South Hill Street, Los Angeles', 'types': ['bar', 'night_club', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.05077199999999, 'lng': -118.2497017 }, 'rating': 4.2, 'rating_n': 1567, 'populartimes': [{ 'name': 'Monday', 'data': [93, 57, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 3, 3, 1, 0, 0, 0, 0, 6, 14, 22, 25, 26] }, { 'name': 'Tuesday', 'data': [27, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 10, 23, 42, 57] }, { 'name': 'Wednesday', 'data': [61, 51, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 2, 11, 32, 65, 93] }, { 'name': 'Thursday', 'data': [93, 66, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 26, 54, 53] }, {
        'name': 'Friday', 'data': [27,
            29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 3, 3, 2, 2, 5, 29, 57, 68]
    }, {
        'name': 'Saturday', 'data': [77, 61, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 3,
            3, 4, 4, 5, 5, 5, 6, 10, 33, 69, 90]
    }, { 'name': 'Sunday', 'data': [100, 89, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 4, 4, 3, 3, 2, 3, 7, 20, 36, 53, 83] }]
}, {
    'id': 'ChIJef1q_RrHwoARMnCXpKfCz3o', 'name': 'Thunderbolt', 'address': '1263 West Temple Street, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0664097, 'lng': -118.2541258 }, 'rating': 4.7, 'rating_n': 165, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 33, 31, 29, 26, 19] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 21, 26, 30, 34, 37, 34, 26] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 67] }, {
        'name': 'Saturday', 'data': [56, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 23, 38, 50, 61, 77, 94, 100, 88]
    }, { 'name': 'Sunday', 'data': [66, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 18, 26, 34, 41, 45, 46, 46, 45, 42, 36, 27] }], 'time_spent': [60, 120]
}, { 'id': 'ChIJRYWea7THwoARJ0XkxTO59Es', 'name': 'Gourmet Wines & Spirits', 'address': '300 South Grand Avenue LP110, Los Angeles', 'types': ['liquor_store', 'bar', 'store', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0525456, 'lng': -118.250561 }, 'rating': 4.7, 'rating_n': 77, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 22, 44, 62, 66, 55, 37, 18, 14, 22, 22, 11, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 3, 7, 3, 3, 11, 29, 48, 51, 40, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 18, 44, 66, 62, 55, 55, 62, 62, 55, 44, 33, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 29, 51, 77, 96, 100, 88, 66, 51, 44, 48, 48, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 74, 100, 55, 40, 66, 92, 100, 88, 70, 59, 0, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 7, 14, 22, 29, 40, 48, 51, 51, 48, 0, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18, 22, 18, 11, 3, 3, 3, 3, 0, 0, 0, 0] }] }, {
    'id': 'ChIJ1emCG03GwoARRw3eW46ZM-A', 'name': 'Vespaio', 'address': '225 South Grand Avenue, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0538862, 'lng': -118.2508013 }, 'rating': 4.2, 'rating_n': 516, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 25, 30, 31, 31, 30, 31, 41, 56, 60, 45, 0, 0, 0]
    }, {
        'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 32, 37, 37, 34, 34, 41, 55,
            63, 60, 44, 25, 0, 0]
    }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 36, 41, 37, 30, 29, 40, 57, 65, 55, 34, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 36, 42, 40, 37, 38, 49, 61, 64, 55, 35, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 21, 22, 23, 30, 50, 79, 100, 98, 75, 44, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 26, 27, 25, 30, 41, 51, 55, 52, 41, 23, 0, 0] }], 'time_spent': [60, 120]
}, {
    'id': 'ChIJTxNVCtvHwoARP6HA_wpcSVg', 'name': 'Bar Henry', 'address': '1228 Sunset Boulevard, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.06903429999999, 'lng': -118.2507302 }, 'rating': 4.6, 'rating_n': 104, 'populartimes': [{ 'name': 'Monday', 'data': [22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 28, 43, 42, 34, 32, 26] }, { 'name': 'Tuesday', 'data': [14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 17, 18, 18, 31, 50, 46] }, { 'name': 'Wednesday', 'data': [23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 30, 50, 69, 75, 64, 43] }, {
        'name': 'Thursday', 'data': [23, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 14, 23, 34, 41, 41, 35]
    }, { 'name': 'Friday', 'data': [25, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 28, 48, 58, 65, 83, 93] }, { 'name': 'Saturday', 'data': [80, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27, 41, 52, 54, 57, 77, 100] }, { 'name': 'Sunday', 'data': [84, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 41, 42, 32, 28, 31, 30] }]
}, {
    'id': 'ChIJKV_WkUvGwoARxDayjmHKl00',
    'name': 'Golden Road Grand Central Market', 'address': '317 South Broadway, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0510559, 'lng': -118.2493896 }, 'rating': 4.3, 'rating_n': 180, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 32, 45, 37, 35, 42, 39, 31, 23, 13, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 33, 45, 45, 40, 37, 35, 30, 21, 11, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 33, 38, 28, 30, 38, 40, 33, 21, 12, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 32, 47, 49, 40, 34, 36, 37, 29, 17, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 49, 72, 69, 55, 53, 59, 56, 43, 24, 0, 0, 0] }, {
        'name': 'Saturday', 'data': [0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 27, 63, 91, 93, 83, 79, 75, 64, 46, 27, 0, 0, 0]
    }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 38, 72, 97, 100, 86, 73, 62, 48, 30, 15, 0, 0, 0] }]
}, {
    'id': 'ChIJITfiK7XHwoARG6IDkwlSETI', 'name': 'Mrs. Fish', 'address': '448 South Hill Street, Los Angeles', 'types': ['art_gallery', 'meal_takeaway', 'bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0488894, 'lng': -118.2514896 }, 'rating': 4.5, 'rating_n': 504, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 24, 39, 48, 41, 25, 10, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 17, 20, 29, 29, 14, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 33, 49, 54, 43, 24, 0] }, {
        'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 27, 46, 71, 90, 87, 64, 35]
    }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 46, 68, 89, 100, 89, 60, 30] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_wait': [{
        'name': 'Monday', 'data':
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name':
            'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [90, 150]
}, {
    'id': 'ChIJYaEcrCXHwoARsvYEJ92JQWg', 'name': 'Kippered', 'address': '361 South Broadway, Los Angeles', 'types': ['bar', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0498435, 'lng': -118.2494726 }, 'rating': 4.9, 'rating_n': 19, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 58, 76, 88, 100, 100, 94, 76, 58] }, {
        'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 70, 94, 94, 82, 58,
            52, 76, 76]
    }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 35, 58, 41, 52, 88, 94, 58, 23] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 17, 47, 47, 23, 35, 58, 29] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23, 58, 76, 41, 23, 23, 17, 5] }]
}, {
    'id': 'ChIJizEM70rGwoARFIPvBFmBUPk', 'name': 'Mezcalero DTLA', 'address': '510 South Broadway, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0476913, 'lng': -118.250879 }, 'rating': 4.5, 'rating_n': 593, 'populartimes': [{ 'name': 'Monday', 'data': [26, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 32, 34, 33, 33, 35, 35, 31] }, { 'name': 'Tuesday', 'data': [24, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 23, 45, 62, 65, 65, 63, 57, 43] }, {
        'name': 'Wednesday', 'data': [28, 16, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 29, 43, 48, 45, 39, 36, 31]
    }, { 'name': 'Thursday', 'data': [22, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 42, 55, 57, 51, 47, 46, 42] }, { 'name': 'Friday', 'data': [32, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 34, 51, 64, 68, 62, 59, 64, 70] }, { 'name': 'Saturday', 'data': [61, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 36, 56, 71, 72, 68, 77, 94, 100] }, {
        'name': 'Sunday', 'data': [80, 50,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27, 36, 45, 50, 51, 48, 41, 33]
    }], 'time_wait': [{
        'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15,
            15, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, 15] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, 15] }, { 'name': 'Sunday', 'data': [15, 15, 0, 0, 0, 0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15] }]
}, {
    'id': 'ChIJB0N_PEvGwoARpoVNbFarPzY', 'name': 'Perch Rooftop Bar', 'address': '452 South Hill Street, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0488505, 'lng': -118.2515378 }, 'rating': 4.4, 'rating_n': 5682, 'populartimes': [{
        'name': 'Monday', 'data': [11,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 19, 29, 37, 42, 47, 44, 30]
    }, { 'name': 'Tuesday', 'data': [12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 35, 52, 61, 58, 48, 37, 25] }, { 'name': 'Wednesday', 'data': [12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 30, 47, 54, 54, 54, 48, 33] }, { 'name': 'Thursday', 'data': [16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 42, 61, 68, 73, 76, 66, 45] }, { 'name': 'Friday', 'data': [23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 22, 40, 59, 74, 86, 96, 97, 82] }, { 'name': 'Saturday', 'data': [56, 29, 0, 0, 0, 0, 0, 0, 0, 0, 21, 31, 41, 47, 48, 46, 45, 50, 63, 80, 93, 99, 100, 89] }, {
        'name': 'Sunday', 'data': [61, 29, 0, 0, 0, 0, 0, 0, 0, 0, 27, 39, 49, 54, 53,
            48, 42, 41, 47, 58, 65, 59, 44, 25]
    }], 'time_spent': [90, 150]
}, {
    'id': 'ChIJTwsCo0rGwoARKKzn_4khivA', 'name': 'Rhythm Room L.A.', 'address': '206 West 6th Street BSMT, Los Angeles', 'types': ['night_club', 'bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.04604099999999, 'lng': -118.251384 }, 'rating': 4.6, 'rating_n': 596, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Thursday', 'data': [0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 7, 16, 27, 35, 32]
    }, { 'name': 'Friday', 'data': [23, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 18, 32, 51, 66, 65] }, { 'name': 'Saturday', 'data': [48, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 21, 33, 68, 100, 98] }, { 'name': 'Sunday', 'data': [64, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }]
}, {
    'id': 'ChIJHSnDjErGwoARZz9rmSQ8ZsQ', 'name': 'The Wolves', 'address': '519 South Spring Street, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0470331, 'lng': -118.250239 }, 'rating': 4.6, 'rating_n': 242, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 24, 32, 40, 49, 52, 44, 28] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 22, 32, 41, 47, 49, 45, 35] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 39, 46, 50, 59, 81, 99] }, { 'name': 'Saturday', 'data': [88, 53, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 32, 49, 63, 72, 83, 96, 100] }, { 'name': 'Sunday', 'data': [81, 49, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27, 40, 49, 51, 45, 33, 21] }]
}, {
    'id': 'ChIJASP38YjHwoARJLHR85C2PCs', 'name': 'Mikaza Sushi and Lounge', 'address': '542 South Broadway, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0470531, 'lng': -118.251437 }, 'rating': 3.9, 'rating_n': 86, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 17, 15, 21, 31, 34, 26, 0, 0, 0, 0, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 43, 32, 31, 39, 47, 47, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 17, 21, 27, 38, 53, 58, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 34, 36, 36, 38, 43, 50, 0, 0, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 78, 91, 98, 100, 93, 84, 0, 0, 0, 0, 0] }, {
        'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 42, 53, 57, 56, 49, 41,
            0, 0, 0, 0, 0]
    }]
}, {
    'id': 'ChIJ7UPWdzXGwoARv3xPWAYT0ok', 'name': 'Las Perlas', 'address': '107 East 6th Street, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.04509840000001, 'lng': -118.2495126 }, 'rating': 4.4, 'rating_n': 531, 'populartimes': [{ 'name': 'Monday', 'data': [37, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 7, 12, 19, 21] }, {
        'name': 'Tuesday', 'data': [16, 8,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 2, 2, 4, 8, 18, 25]
    }, { 'name': 'Wednesday', 'data': [22, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 9, 10, 12, 17, 24, 27] }, { 'name': 'Thursday', 'data': [22, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 12, 16, 19, 25, 39, 52] }, { 'name': 'Friday', 'data': [48, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 8, 10, 18, 41, 76, 100] }, {
        'name': 'Saturday', 'data': [91,
            56, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 5, 7, 11, 23, 46, 75, 92]
    }, {
        'name': 'Sunday', 'data': [81, 52, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            2, 2, 4, 6, 8, 10, 12, 16, 26, 41, 47]
    }], 'time_spent': [60, 150]
}, {
    'id': 'ChIJgZ1snzXGwoARCQvieFp61fU', 'name': "Cole's French Dip", 'address':
        '118 East 6th Street, Los Angeles', 'types': ['restaurant', 'bar', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0447898, 'lng': -118.2495086 }, 'rating': 4.5, 'rating_n': 1252, 'populartimes': [{ 'name': 'Monday', 'data': [66, 47, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 33, 40, 49, 56, 59, 59, 56, 45] }, { 'name': 'Tuesday', 'data': [35, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 63, 84, 92, 87, 78, 70, 63, 50] }, { 'name': 'Wednesday', 'data': [33, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 38, 50, 57, 59, 56, 47, 36] }, { 'name': 'Thursday', 'data': [26, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 45, 61, 59, 45, 33, 28, 24] }, { 'name': 'Friday', 'data': [21, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 52, 63, 68, 70, 64, 56, 45, 33] }, { 'name': 'Saturday', 'data': [22, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 56, 85, 91, 73, 57, 57, 59] }, { 'name': 'Sunday', 'data': [54, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 36, 75, 100, 94, 82, 78, 82, 78] }]
}, {
    'id': 'ChIJGY8DwUrGwoARg54laB-pNlk', 'name': 'Garçons de Café', 'address': '541 South Spring Street UNIT 114, Los Angeles', 'types': ['bar', 'cafe', 'food', 'store', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.04698800000001, 'lng': -118.251414 }, 'rating': 4.8, 'rating_n': 106, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 2, 5, 10, 26, 76, 94, 81, 57, 0, 0]
    }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 5, 13, 21, 28, 31, 26, 18,
            0, 0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 15, 34, 52, 68, 81, 92, 94, 81, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 10, 23, 34, 39, 36, 39, 52, 76, 97, 100, 84, 0] }, {
        'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 7, 21, 31, 31, 21, 7, 2, 31, 55, 26, 0, 0, 0]
    }]
}, {
    'id': 'ChIJt7WimEvGwoAR_jB4MtNywYk', 'name': 'Chatterbox Bar', 'address': '351 South Broadway, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0499774, 'lng': -118.2493608 }, 'rating': 4.6, 'rating_n': 122, 'populartimes': [{ 'name': 'Monday', 'data': [48, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 45, 41, 35, 28, 24, 23] }, { 'name': 'Tuesday', 'data': [23, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 17, 17, 21, 32, 40] }, { 'name': 'Wednesday', 'data': [35, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 19, 19, 16, 15, 30] }, {
        'name': 'Thursday', 'data': [45, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 14, 19, 28, 42, 58, 65]
    }, { 'name': 'Friday', 'data': [55, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 10, 21, 36, 47, 56, 70] }, { 'name': 'Saturday', 'data': [78, 57, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 18, 34, 51, 67, 85, 100] }, { 'name': 'Sunday', 'data': [88, 53, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 11, 18, 25, 28, 31, 42] }]
}, {
    'id': 'ChIJt7WimEvGwoARBru9zCa03t4', 'name': 'The Slipper Clutch', 'address': '351 South Broadway, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0499743, 'lng': -118.249396 }, 'rating': 4.6, 'rating_n': 167, 'populartimes': [{ 'name': 'Monday', 'data': [34, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 24, 35, 37] }, { 'name': 'Tuesday', 'data': [33, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 32, 50, 56] }, { 'name': 'Wednesday', 'data': [46, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 14, 20, 23] }, {
        'name': 'Thursday', 'data': [22, 16, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 19, 40, 60, 67]
    }, { 'name': 'Friday', 'data': [54, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 26, 37, 46, 60] }, { 'name': 'Saturday', 'data': [62, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 43, 73, 72, 89] }, { 'name': 'Sunday', 'data': [100, 48, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 17, 37, 46] }], 'time_spent': [60, 150]
}, { 'id': 'ChIJWVTnvEvGwoARM5ACOJUd95g', 'name': 'Casa India', 'address': '348 South Broadway, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0498082, 'lng': -118.2489072 }, 'rating': 4.1, 'rating_n': 102, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 7, 8, 8, 8, 9, 9, 10, 12, 13, 13, 13, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 3, 5, 6, 6, 6, 5, 7, 10, 13, 14, 12, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 4, 3, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 3, 3, 2, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 2, 6, 11, 14, 15, 15, 19, 24, 29, 30, 27, 21] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 10, 19, 30, 40, 49, 53, 54, 56, 63, 75, 90, 100, 99, 86] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 8, 24, 49, 68, 68, 53, 40, 40, 47, 52, 50, 42, 30] }] }, {
    'id': 'ChIJ16rgokvGwoARgLmCBWa28wI', 'name': 'Precinct', 'address': '357 South Broadway, Los Angeles', 'types': ['night_club', 'bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0498149, 'lng': -118.2493321 }, 'rating': 4.1, 'rating_n': 184, 'populartimes': [{ 'name': 'Monday', 'data': [16, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Tuesday', 'data': [0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 9, 12, 14]
    }, { 'name': 'Wednesday', 'data': [12, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 11, 14, 17] }, { 'name': 'Thursday', 'data': [16, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 12, 18, 23, 25, 28] }, { 'name': 'Friday', 'data': [33, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 14, 22, 33, 48, 65] }, { 'name': 'Saturday', 'data': [67, 46, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 14, 29, 50, 77, 100] }, { 'name': 'Sunday', 'data': [97, 64, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 11, 15, 19, 23, 27, 29, 31, 31, 30, 29, 26, 21] }], 'time_spent': [45, 180]
}, {
    'id': 'ChIJQSwgGUzGwoARhEKotmw64n8', 'name': 'The Redwood Bar & Grill', 'address': '316 West 2nd Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0527311, 'lng': -118.2474087 }, 'rating': 4.3, 'rating_n': 719, 'populartimes': [{ 'name': 'Monday', 'data': [15, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 6, 12, 25, 21, 12, 15, 21, 31, 37, 40, 34, 28] }, {
        'name': 'Tuesday', 'data': [18, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 34, 37, 37, 34, 28, 18, 15,
            15, 21, 28, 28, 18]
    }, { 'name': 'Wednesday', 'data': [9, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 37, 43, 46, 43, 28, 15, 12, 15, 18, 18, 12, 6, 3] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 87, 78, 84, 100, 87, 50, 18, 3, 3, 6, 6, 6, 3] }, { 'name': 'Friday', 'data': [3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 31, 43, 40, 25, 9, 3, 3, 3, 9, 18, 25, 25] }, { 'name': 'Saturday', 'data': [25, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 6, 6, 6, 6, 3, 3, 9, 25, 56, 87, 96, 78] }, { 'name': 'Sunday', 'data': [46, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 9, 15, 25, 28, 31, 28, 25, 28, 31, 28] }]
}, {
    'id': 'ChIJgegyNVrHwoARkEbBhAI03ok', 'name': 'Hill Street Bar & Restaurant', 'address': '200 South Hill Street, Los Angeles', 'types': ['bar',
        'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0529459, 'lng': -118.2477338 }, 'rating': 4.5, 'rating_n': 176, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 40, 84, 100, 66, 43, 39, 36, 29, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 56, 100, 93, 58, 50, 59, 64, 58, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 66, 81, 82, 70, 56, 47, 44, 40, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 58, 81, 88, 79, 68, 65, 63, 51, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 57, 73, 76, 70, 71, 86, 91, 64, 0, 0, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_wait': [{
            'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
                0, 0, 0, 0, 0, 0, 0, 0]
        }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }]
}, {
    'id': 'ChIJPfW-MErGwoARpWWpGbfDuPo', 'name': 'Bar Amá', 'address': 'FARMERS AND MERCHANTS BANK BUILDING, 118 4th Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0484148, 'lng': -118.2479281 }, 'rating': 4.4, 'rating_n': 555, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 32, 45, 45, 38, 49, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 55, 71, 64, 39, 0, 0] }, {
        'name': 'Thursday',
        'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 54, 77, 88, 80, 58, 0, 0]
    }, {
        'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 44, 70, 88, 89, 71, 0, 0]
    }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 59, 90, 100, 85, 61, 0, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 39, 61, 77, 79, 65, 0, 0, 0] }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0] }, {
        'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 15, 15, 15, 0, 0, 0, 0]
    }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }], 'time_spent': [60, 120]
}, {
    'id': 'ChIJabdB69fHwoARYVLhd3IdVbM', 'name': 'The Stowaway', 'address': '416 South Spring Street, Los Angeles', 'types': ['bar', 'night_club', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0483875, 'lng': -118.248524 }, 'rating': 4.5, 'rating_n': 21, 'populartimes': [{ 'name': 'Monday', 'data': [76, 55, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 11, 15, 23, 36] }, {
        'name': 'Tuesday', 'data':
            [39, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 15, 26, 44, 55]
    }, { 'name': 'Wednesday', 'data': [51, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 10, 29, 48, 56] }, { 'name': 'Thursday', 'data': [56, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 18, 36, 45, 54, 73] }, { 'name': 'Friday', 'data': [79, 57, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 23, 52, 84, 100] }, { 'name': 'Saturday', 'data': [86, 55, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 13, 26, 47, 69, 77] }, { 'name': 'Sunday', 'data': [66, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 14, 23, 40, 56, 68] }], 'time_spent': [180, 180]
}, {
    'id': 'ChIJJV1_EkrGwoARvj3I4zlbyMA', 'name': 'The Love Song Bar', 'address': '450 South Main Street, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0470379, 'lng': -118.247999 }, 'rating': 4.6, 'rating_n': 125, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 0]
    }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 13, 30, 65, 100, 96] }, { 'name': 'Thursday', 'data': [58, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 9, 13, 17, 18, 17] }, { 'name': 'Friday', 'data': [14, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 11, 16, 18, 24, 31] }, { 'name': 'Saturday', 'data': [29, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 8, 16, 29, 46, 55] }, { 'name': 'Sunday', 'data': [48, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 10, 15, 14, 8] }], 'time_spent': [45, 150]
}, {
    'id': 'ChIJXWulT0rGwoARFvjKPOWR40s', 'name': 'Le Petit Paris', 'address': '418 South Spring Street, Los Angeles', 'types': ['bar', 'night_club', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0483433, 'lng': -118.248527 }, 'rating': 4.3, 'rating_n': 797, 'populartimes': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27, 31, 34, 43, 49, 0, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 35, 42, 54, 49, 0, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 30, 43, 59, 72, 73, 56, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 21, 26, 31, 33, 0, 0, 52, 70, 89, 100, 94, 74, 0] }, {
        'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 21, 25, 28, 29, 0, 0, 35, 41, 47, 47,
            37, 0, 0]
    }], 'time_wait': [{ 'name': 'Monday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0] }, {
        'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0,
            0]
    }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 30, 30, 30, 0, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 0, 0, 0, 0, 15, 30, 45, 45, 30, 15, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 15, 15, 0, 0, 0, 0, 15, 15, 15, 0, 0, 0] }], 'time_spent': [90, 150]
}, {
    'id': 'ChIJ0eVabUnGwoARp-JU3rlMD8s', 'name': 'The New Jalisco Bar', 'address': '245 South Main Street, Los Angeles', 'types': ['bar', 'night_club', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0502685, 'lng': -118.2454215 }, 'rating': 4, 'rating_n': 119, 'populartimes': [{
        'name': 'Monday', 'data': [62, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 0, 0, 10, 33, 52]
    }, { 'name': 'Tuesday', 'data': [51, 46, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 16, 35] }, { 'name': 'Wednesday', 'data': [43, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 13, 22] }, {
        'name': 'Thursday', 'data': [24, 17, 0, 0, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 28, 66, 89]
    }, {
        'name': 'Friday', 'data': [90, 77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
            0, 0, 21, 56, 73]
    }, { 'name': 'Saturday', 'data': [56, 53, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 33, 69, 88] }, { 'name': 'Sunday', 'data': [100, 88, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 6, 12, 22, 34, 44, 51, 58] }], 'time_spent': [60, 210]
}, { 'id': 'ChIJNZg1cUnGwoAR05Ns_8F0y_k', 'name': 'Five Star Bar', 'address': '267 South Main Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0498425, 'lng': -118.2458241 }, 'rating': 4.2, 'rating_n': 490, 'populartimes': [{ 'name': 'Monday', 'data': [40, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 8, 18, 22, 24, 26, 26, 24, 25, 28, 31] }, { 'name': 'Tuesday', 'data': [29, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 4, 5, 8, 9, 11, 12, 12, 12, 12, 11, 12] }, { 'name': 'Wednesday', 'data': [25, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 4, 10, 10, 4, 1, 3, 9, 13, 10, 16] }, { 'name': 'Thursday', 'data': [27, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 16, 19, 17, 12, 9, 10, 13, 14, 13, 18, 37] }, { 'name': 'Friday', 'data': [54, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 16, 29, 41, 42, 33, 24, 25, 34, 43, 50, 71] }, { 'name': 'Saturday', 'data': [100, 70, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 4, 9, 16, 25, 39, 55, 65, 64, 56, 60] }, { 'name': 'Sunday', 'data': [78, 68, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 13, 28, 44, 54, 52, 49, 51, 55, 52] }] }, {
    'id': 'ChIJT9zKdknGwoARlWfCsvhRzC4', 'name': 'La Costena Bar', 'address': '271 South Main Street, Los Angeles', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0497928, 'lng': -118.2459619 }, 'rating': 4.6, 'rating_n': 38, 'populartimes': [{ 'name': 'Monday', 'data': [75, 69, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4, 4, 8, 18, 32, 42, 42, 32, 18, 8] }, { 'name': 'Tuesday', 'data': [4, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 6, 14, 14, 8, 6, 10, 16, 22, 20, 14] }, {
        'name': 'Wednesday', 'data': [8, 2, 0, 0,
            0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 4, 12, 20, 20, 16, 10, 6, 10, 18]
    }, {
        'name': 'Thursday', 'data': [24, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 4, 4,
            6, 6, 8, 10, 10, 10, 10, 10, 18]
    }, { 'name': 'Friday', 'data': [28, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 8, 20, 36, 48, 55, 59, 75] }, { 'name': 'Saturday', 'data': [81, 53, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 20, 28, 36, 42, 46, 46, 46, 53, 71, 93, 97] }, { 'name': 'Sunday', 'data': [81, 100, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 14, 18, 24, 32, 38, 44, 48, 51, 57, 67] }]
}, {
    'id': 'ChIJ1-pP9EjGwoARJ96IwETSTDE', 'name': 'Justice Urban Tavern', 'address': '120 South Los Angeles Street, Los Angeles', 'types': ['bar', 'restaurant', 'food', 'point_of_interest', 'establishment'],
    'coordinates': { 'lat': 34.0506689, 'lng': -118.2425757 }, 'rating': 4.1, 'rating_n': 288, 'populartimes': [{
        'name': 'Monday', 'data': [0, 0, 0, 0,
            0, 0, 11, 19, 25, 23, 19, 17, 61, 32, 1, 1, 3, 17, 32, 44, 44, 32, 17, 0]
    }, {
        'name': 'Tuesday', 'data': [0, 0, 0, 0, 0, 0, 5, 13, 19, 19, 15, 44,
            78, 15, 1, 1, 1, 11, 21, 26, 28, 23, 13, 0]
    }, { 'name': 'Wednesday', 'data': [0, 0, 0, 0, 0, 0, 5, 13, 19, 23, 28, 40, 55, 50, 25, 9, 13, 32, 53, 61, 48, 25, 7, 0] }, { 'name': 'Thursday', 'data': [0, 0, 0, 0, 0, 0, 7, 13, 19, 23, 25, 23, 19, 13, 9, 7, 17, 42, 71, 78, 55, 23, 1, 0] }, { 'name': 'Friday', 'data': [0, 0, 0, 0, 0, 0, 17, 26, 36, 44, 50, 50, 46, 38, 28, 19, 15, 23, 51, 84, 84, 50, 15, 0] }, { 'name': 'Saturday', 'data': [0, 0, 0, 0, 0, 0, 7, 21, 38, 53, 61, 55, 44, 32, 25, 23, 23, 34, 73, 100, 67, 25, 9, 0] }, { 'name': 'Sunday', 'data': [0, 0, 0, 0, 0, 0, 25, 42, 55, 59, 51, 38, 30, 34, 15, 11, 23, 38, 51, 57, 50, 36, 19, 0] }], 'time_spent': [20, 60]
}, {
    'id': 'ChIJKeFQGoPIwoARTTskgGDYJWY', 'name': "Ild's Sports Saloon", 'address': 'United States', 'types': ['bar', 'point_of_interest', 'establishment'], 'coordinates': { 'lat': 34.0240768, 'lng': -118.2429275 },
    'rating': 4, 'rating_n': 202, 'current_popularity': 36, 'populartimes': [{ 'name': 'Monday', 'data': [27, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 7, 15, 22, 26, 31, 39, 45, 44, 34, 24, 20, 23, 23] }, {
        'name': 'Tuesday', 'data': [14, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 20, 31, 40, 41, 40, 48, 76, 100, 84,
            49, 31, 28]
    }, { 'name': 'Wednesday', 'data': [20, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11, 18, 22, 27, 32, 37, 37, 32, 34, 49, 74, 89, 79] }, { 'name': 'Thursday', 'data': [50, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 12, 21, 30, 37, 41, 42, 41, 41, 45, 56, 69, 74, 65] }, { 'name': 'Friday', 'data': [46, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 8, 18, 30, 40, 44, 41, 34, 27, 28, 39, 53, 64, 78] }, {
        'name': 'Saturday', 'data': [72, 31, 0, 0, 0, 0, 0, 0, 0, 3, 11, 22,
            34, 45, 51, 52, 46, 36, 27, 25, 37, 58, 78, 78]
    }, {
        'name': 'Sunday', 'data': [57, 28, 0, 0, 0, 0, 0, 0, 0, 8, 15, 22, 30, 36, 40, 40, 37, 31, 26,
            26, 35, 42, 35, 26]
    }], 'time_spent': [20, 90]
}];

export default la;
